iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } SYST_CALIB;

} __attribute__((packed));

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct FTFE_FlashConfig_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } NV_BACKKEY4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } NV_FPROT3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } NV_FPROT2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } NV_FPROT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } NV_FPROT0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEC:2;
      uint64_t FSLACC:2;
      uint64_t MEEN:2;
      uint64_t KEYEN:2;
    } __attribute__((packed)) B;
  } NV_FSEC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LPBOOT0:1;
      uint64_t reservedSpace0:1;
      uint64_t NMI_DIS:1;
      uint64_t RESET_PIN_CFG:1;
      uint64_t LPBOOT1:1;
    } __attribute__((packed)) B;
  } NV_FOPT;

} __attribute__((packed));

#define FTFE_FlashConfig (*(volatile struct FTFE_FlashConfig_tag *) 0x400)

struct FTFE_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t MGSTAT0:1;
      uint64_t reservedSpace0:3;
      uint64_t FPVIOL:1;
      uint64_t ACCERR:1;
      uint64_t RDCOLERR:1;
      uint64_t CCIF:1;
    } __attribute__((packed)) B;
  } FTFE_FSTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EEERDY:1;
      uint64_t RAMRDY:1;
      uint64_t PFLSH:1;
      uint64_t SWAP:1;
      uint64_t ERSSUSP:1;
      uint64_t ERSAREQ:1;
      uint64_t RDCOLLIE:1;
      uint64_t CCIE:1;
    } __attribute__((packed)) B;
  } FTFE_FCNFG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEC:2;
      uint64_t FSLACC:2;
      uint64_t MEEN:2;
      uint64_t KEYEN:2;
    } __attribute__((packed)) B;
  } FTFE_FSEC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OPT:8;
    } __attribute__((packed)) B;
  } FTFE_FOPT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOBB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOBA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } FTFE_FCCOB8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } FTFE_FPROT3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } FTFE_FPROT2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } FTFE_FPROT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } FTFE_FPROT0;

  uint8_t res0[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPROT:8;
    } __attribute__((packed)) B;
  } FTFE_FEPROT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DPROT:8;
    } __attribute__((packed)) B;
  } FTFE_FDPROT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCH3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCH2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCH1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCH0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCL3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCL2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCL1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XA:8;
    } __attribute__((packed)) B;
  } FTFE_XACCL0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCH3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCH2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCH1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCH0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCL3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCL2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCL1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SA:8;
    } __attribute__((packed)) B;
  } FTFE_SACCL0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SGSIZE:8;
    } __attribute__((packed)) B;
  } FTFE_FACSS;

  uint8_t res1[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NUMSG:8;
    } __attribute__((packed)) B;
  } FTFE_FACSN;

  uint8_t res2[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DFDIF:1;
    } __attribute__((packed)) B;
  } FTFE_FERSTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DFDIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FDFD:1;
    } __attribute__((packed)) B;
  } FTFE_FERCNFG;

} __attribute__((packed));

#define FTFE (*(volatile struct FTFE_tag *) 0x40020000)

struct DMAMUX0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } CHCFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } CHCFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } CHCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } CHCFG0;

} __attribute__((packed));

#define DMAMUX0 (*(volatile struct DMAMUX0_tag *) 0x40021000)

