iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t reservedSpace0:4;
      uint64_t TOF:1;
    } __attribute__((packed)) B;
  } TPM1_STATUS;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMBINE0:1;
      uint64_t COMSWAP0:1;
      uint64_t reservedSpace0:6;
      uint64_t COMBINE1:1;
      uint64_t COMSWAP1:1;
    } __attribute__((packed)) B;
  } TPM1_COMBINE;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL0:1;
      uint64_t POL1:1;
      uint64_t POL2:1;
      uint64_t POL3:1;
    } __attribute__((packed)) B;
  } TPM1_POL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0FVAL:4;
      uint64_t CH1FVAL:4;
      uint64_t CH2FVAL:4;
      uint64_t CH3FVAL:4;
    } __attribute__((packed)) B;
  } TPM1_FILTER;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUADEN:1;
      uint64_t TOFDIR:1;
      uint64_t QUADIR:1;
      uint64_t QUADMODE:1;
    } __attribute__((packed)) B;
  } TPM1_QDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t DOZEEN:1;
      uint64_t DBGMODE:2;
      uint64_t GTBSYNC:1;
      uint64_t GTBEEN:1;
      uint64_t reservedSpace1:6;
      uint64_t CSOT:1;
      uint64_t CSOO:1;
      uint64_t CROT:1;
      uint64_t CPOT:1;
      uint64_t reservedSpace2:2;
      uint64_t TRGPOL:1;
      uint64_t TRGSRC:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } TPM1_CONF;

} __attribute__((packed));

#define TPM1 (*(volatile struct TPM1_tag *) 0x40039000)

struct TPM2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:3;
      uint64_t CMOD:2;
      uint64_t CPWMS:1;
      uint64_t TOIE:1;
      uint64_t TOF:1;
      uint64_t DMA:1;
    } __attribute__((packed)) B;
  } TPM2_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } TPM2_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:16;
    } __attribute__((packed)) B;
  } TPM2_MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t reservedSpace0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
    } __attribute__((packed)) B;
  } TPM2_C0SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } TPM2_C0V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t reservedSpace0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
    } __attribute__((packed)) B;
  } TPM2_C1SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } TPM2_C1V;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t reservedSpace0:4;
      uint64_t TOF:1;
    } __attribute__((packed)) B;
  } TPM2_STATUS;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMBINE0:1;
      uint64_t COMSWAP0:1;
      uint64_t reservedSpace0:6;
      uint64_t COMBINE1:1;
      uint64_t COMSWAP1:1;
    } __attribute__((packed)) B;
  } TPM2_COMBINE;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL0:1;
      uint64_t POL1:1;
      uint64_t POL2:1;
      uint64_t POL3:1;
    } __attribute__((packed)) B;
  } TPM2_POL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0FVAL:4;
      uint64_t CH1FVAL:4;
      uint64_t CH2FVAL:4;
      uint64_t CH3FVAL:4;
    } __attribute__((packed)) B;
  } TPM2_FILTER;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUADEN:1;
      uint64_t TOFDIR:1;
      uint64_t QUADIR:1;
      uint64_t QUADMODE:1;
    } __attribute__((packed)) B;
  } TPM2_QDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t DOZEEN:1;
      uint64_t DBGMODE:2;
      uint64_t GTBSYNC:1;
      uint64_t GTBEEN:1;
      uint64_t reservedSpace1:6;
      uint64_t CSOT:1;
      uint64_t CSOO:1;
      uint64_t CROT:1;
      uint64_t CPOT:1;
      uint64_t reservedSpace2:2;
      uint64_t TRGPOL:1;
      uint64_t TRGSRC:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } TPM2_CONF;

} __attribute__((packed));

#define TPM2 (*(volatile struct TPM2_tag *) 0x4003a000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } ADC0_SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } ADC0_SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t ADLSMP:1;
      uint64_t ADIV:2;
      uint64_t ADLPC:1;
    } __attribute__((packed)) B;
  } ADC0_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADLSTS:2;
      uint64_t ADHSC:1;
      uint64_t ADACKEN:1;
      uint64_t MUXSEL:1;
    } __attribute__((packed)) B;
  } ADC0_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
    } __attribute__((packed)) B;
  } ADC0_RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
    } __attribute__((packed)) B;
  } ADC0_RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } ADC0_CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } ADC0_CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
    } __attribute__((packed)) B;
  } ADC0_SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t reservedSpace0:2;
      uint64_t CALF:1;
      uint64_t CAL:1;
    } __attribute__((packed)) B;
  } ADC0_SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
    } __attribute__((packed)) B;
  } ADC0_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:16;
    } __attribute__((packed)) B;
  } ADC0_PG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MG:16;
    } __attribute__((packed)) B;
  } ADC0_MG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPD:6;
    } __attribute__((packed)) B;
  } ADC0_CLPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:6;
    } __attribute__((packed)) B;
  } ADC0_CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP4:10;
    } __attribute__((packed)) B;
  } ADC0_CLP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:9;
    } __attribute__((packed)) B;
  } ADC0_CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:8;
    } __attribute__((packed)) B;
  } ADC0_CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:7;
    } __attribute__((packed)) B;
  } ADC0_CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:6;
    } __attribute__((packed)) B;
  } ADC0_CLP0;

