iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMD:6;
    } __attribute__((packed)) B;
  } ADC0_CLMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMS:6;
    } __attribute__((packed)) B;
  } ADC0_CLMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM4:10;
    } __attribute__((packed)) B;
  } ADC0_CLM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM3:9;
    } __attribute__((packed)) B;
  } ADC0_CLM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM2:8;
    } __attribute__((packed)) B;
  } ADC0_CLM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM1:7;
    } __attribute__((packed)) B;
  } ADC0_CLM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM0:6;
    } __attribute__((packed)) B;
  } ADC0_CLM0;

} __attribute__((packed));

#define ADC0 (*(volatile struct ADC0_tag *) 0x4003b000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSR:32;
    } __attribute__((packed)) B;
  } RTC_TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPR:16;
    } __attribute__((packed)) B;
  } RTC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAR:32;
    } __attribute__((packed)) B;
  } RTC_TAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:8;
      uint64_t CIR:8;
      uint64_t TCV:8;
      uint64_t CIC:8;
    } __attribute__((packed)) B;
  } RTC_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t WPE:1;
      uint64_t SUP:1;
      uint64_t UM:1;
      uint64_t WPS:1;
      uint64_t reservedSpace0:3;
      uint64_t OSCE:1;
      uint64_t reservedSpace1:1;
      uint64_t SC16P:1;
      uint64_t SC8P:1;
      uint64_t SC4P:1;
      uint64_t SC2P:1;
    } __attribute__((packed)) B;
  } RTC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t TOF:1;
      uint64_t TAF:1;
      uint64_t reservedSpace0:1;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } RTC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TCL:1;
      uint64_t CRL:1;
      uint64_t SRL:1;
      uint64_t LRL:1;
    } __attribute__((packed)) B;
  } RTC_LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIIE:1;
      uint64_t TOIE:1;
      uint64_t TAIE:1;
      uint64_t reservedSpace0:1;
      uint64_t TSIE:1;
      uint64_t reservedSpace1:2;
      uint64_t WPON:1;
    } __attribute__((packed)) B;
  } RTC_IER;

} __attribute__((packed));

#define RTC (*(volatile struct RTC_tag *) 0x4003d000)

struct LPTMR0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TMS:1;
      uint64_t TFC:1;
      uint64_t TPP:1;
      uint64_t TPS:2;
      uint64_t TIE:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } LPTMR0_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:2;
      uint64_t PBYP:1;
      uint64_t PRESCALE:4;
    } __attribute__((packed)) B;
  } LPTMR0_PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPARE:16;
    } __attribute__((packed)) B;
  } LPTMR0_CMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } LPTMR0_CNR;

} __attribute__((packed));

#define LPTMR0 (*(volatile struct LPTMR0_tag *) 0x40040000)

struct RFSYS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } RFSYS_REG7;

} __attribute__((packed));

#define RFSYS (*(volatile struct RFSYS_tag *) 0x40041000)

struct SIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t OSC32KOUT:2;
      uint64_t OSC32KSEL:2;
      uint64_t SIM_MISCTL:1;
    } __attribute__((packed)) B;
  } SIM_SOPT1;

  uint8_t res0[4096];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CLKOUTSEL:3;
      uint64_t reservedSpace1:16;
      uint64_t TPMSRC:2;
      uint64_t LPUART0SRC:2;
      uint64_t LPUART1SRC:2;
    } __attribute__((packed)) B;
  } SIM_SOPT2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t TPM1CH0SRC:1;
      uint64_t reservedSpace1:1;
      uint64_t TPM2CH0SRC:1;
      uint64_t reservedSpace2:3;
      uint64_t TPM0CLKSEL:1;
      uint64_t TPM1CLKSEL:1;
      uint64_t TPM2CLKSEL:1;
    } __attribute__((packed)) B;
  } SIM_SOPT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART0TXSRC:2;
      uint64_t LPUART0RXSRC:1;
      uint64_t reservedSpace0:1;
      uint64_t LPUART1TXSRC:2;
      uint64_t LPUART1RXSRC:1;
      uint64_t reservedSpace1:9;
      uint64_t LPUART0ODE:1;
      uint64_t LPUART1ODE:1;
    } __attribute__((packed)) B;
  } SIM_SOPT5;

