iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0TRGSEL:4;
      uint64_t ADC0PRETRGSEL:1;
      uint64_t reservedSpace0:2;
      uint64_t ADC0ALTTRGEN:1;
    } __attribute__((packed)) B;
  } SIM_SOPT7;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINID:4;
      uint64_t reservedSpace0:3;
      uint64_t DIEID:5;
      uint64_t REVID:4;
      uint64_t SRAMSIZE:4;
      uint64_t SERIESID:4;
      uint64_t SUBFAMID:3;
      uint64_t reservedSpace1:1;
      uint64_t FAMID:4;
    } __attribute__((packed)) B;
  } SIM_SDID;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CMT_bitfield:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C0_bitfield:1;
      uint64_t I2C1_bitfield:1;
      uint64_t reservedSpace2:11;
      uint64_t CMP:1;
      uint64_t VREF_bitfield:1;
    } __attribute__((packed)) B;
  } SIM_SCGC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPTMR:1;
      uint64_t reservedSpace0:8;
      uint64_t PORTA_bitfield:1;
      uint64_t PORTB_bitfield:1;
      uint64_t PORTC_bitfield:1;
      uint64_t reservedSpace1:8;
      uint64_t LPUART0_bitfield:1;
      uint64_t LPUART1:1;
      uint64_t reservedSpace2:2;
      uint64_t LTC:1;
      uint64_t RSIM_bitfield:1;
      uint64_t DCDC_bitfield:1;
      uint64_t BTLL:1;
      uint64_t PHYDIG:1;
      uint64_t reservedSpace3:2;
      uint64_t GEN_FSK:1;
    } __attribute__((packed)) B;
  } SIM_SCGC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTF:1;
      uint64_t DMAMUX:1;
      uint64_t reservedSpace0:2;
      uint64_t FLEXCAN0:1;
      uint64_t reservedSpace1:4;
      uint64_t TRNG:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI0:1;
      uint64_t SPI1:1;
      uint64_t reservedSpace3:9;
      uint64_t PIT_bitfield:1;
      uint64_t TPM0_bitfield:1;
      uint64_t TPM1_bitfield:1;
      uint64_t TPM2_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace4:1;
      uint64_t RTC_bitfield:1;
    } __attribute__((packed)) B;
  } SIM_SCGC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DMA:1;
    } __attribute__((packed)) B;
  } SIM_SCGC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t OUTDIV4:3;
      uint64_t reservedSpace1:9;
      uint64_t OUTDIV1:4;
    } __attribute__((packed)) B;
  } SIM_CLKDIV1;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHDIS:1;
      uint64_t FLASHDOZE:1;
      uint64_t reservedSpace0:6;
      uint64_t DEPART:4;
      uint64_t reservedSpace1:4;
      uint64_t EESIZE:4;
      uint64_t reservedSpace2:4;
      uint64_t PFSIZE:4;
      uint64_t NVMSIZE:4;
    } __attribute__((packed)) B;
  } SIM_FCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MAXADDR1:7;
      uint64_t PFLSH:1;
      uint64_t MAXADDR0:7;
      uint64_t SWAPPFLSH:1;
    } __attribute__((packed)) B;
  } SIM_FCFG2;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:16;
    } __attribute__((packed)) B;
  } SIM_UIDMH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } SIM_UIDML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } SIM_UIDL;

  uint8_t res7[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COPW:1;
      uint64_t COPCLKS:1;
      uint64_t COPT:2;
      uint64_t COPSTPEN:1;
      uint64_t COPDBGEN:1;
      uint64_t COPCLKSEL:2;
    } __attribute__((packed)) B;
  } SIM_COPC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRVCOP:8;
    } __attribute__((packed)) B;
  } SIM_SRVCOP;

} __attribute__((packed));

#define SIM (*(volatile struct SIM_tag *) 0x40047000)

struct PORTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR2;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t reservedSpace0:5;
      uint64_t MUX:4;
      uint64_t reservedSpace1:4;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } PCR19;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } GPCHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } GICLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } GICHR;

