iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KS:5;
    } __attribute__((packed)) B;
  } KS;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS:12;
    } __attribute__((packed)) B;
  } DS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICVS:5;
    } __attribute__((packed)) B;
  } ICVS;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALL:1;
      uint64_t AES:1;
    } __attribute__((packed)) B;
  } COM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM:1;
      uint64_t reservedSpace0:7;
      uint64_t IFE:1;
      uint64_t IFR:1;
      uint64_t reservedSpace1:2;
      uint64_t OFE:1;
      uint64_t OFR:1;
      uint64_t reservedSpace2:2;
      uint64_t IFS:1;
      uint64_t OFS:1;
      uint64_t reservedSpace3:2;
      uint64_t KIS:1;
      uint64_t KOS:1;
      uint64_t CIS:1;
      uint64_t COS:1;
      uint64_t reservedSpace4:7;
      uint64_t KAL:1;
    } __attribute__((packed)) B;
  } CTL;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM:1;
      uint64_t reservedSpace0:1;
      uint64_t CDS:1;
      uint64_t CICV:1;
      uint64_t reservedSpace1:1;
      uint64_t CCR:1;
      uint64_t CKR:1;
      uint64_t reservedSpace2:23;
      uint64_t COF:1;
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } CW;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AB:1;
      uint64_t reservedSpace1:14;
      uint64_t DI:1;
      uint64_t reservedSpace2:3;
      uint64_t EI:1;
    } __attribute__((packed)) B;
  } STA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRID1:4;
      uint64_t reservedSpace0:4;
      uint64_t CL1:4;
    } __attribute__((packed)) B;
  } ESTA;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AADSZ:4;
      uint64_t reservedSpace0:27;
      uint64_t AL:1;
    } __attribute__((packed)) B;
  } AADSZ;

  uint8_t res7[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTX:32;
    } __attribute__((packed)) B;
  } CTX_13;

  uint8_t res8[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } KEY_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } KEY_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } KEY_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } KEY_3;

  uint8_t res9[736];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIN_REV:8;
      uint64_t MAJ_REV:8;
      uint64_t IP_ID:16;
    } __attribute__((packed)) B;
  } VID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECO_REV:8;
      uint64_t ARCH_ERA:8;
    } __attribute__((packed)) B;
  } VID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESREV:4;
      uint64_t AESVID:4;
    } __attribute__((packed)) B;
  } CHAVID;

  uint8_t res10[708];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFL:7;
      uint64_t reservedSpace0:8;
      uint64_t IFF:1;
      uint64_t OFL:7;
      uint64_t reservedSpace1:8;
      uint64_t OFF:1;
    } __attribute__((packed)) B;
  } FIFOSTA;

  uint8_t res11[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFIFO:32;
    } __attribute__((packed)) B;
  } IFIFO;

  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFIFO:32;
    } __attribute__((packed)) B;
  } OFIFO;

} __attribute__((packed));

#define LTC0 (*(volatile struct LTC0_tag *) 0x40058000)

struct RSIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_RF_OSC_REQ_EN:1;
      uint64_t BLE_RF_OSC_REQ_STAT:1;
      uint64_t reservedSpace0:2;
      uint64_t BLE_RF_OSC_REQ_INT_EN:1;
      uint64_t BLE_RF_OSC_REQ_INT:1;
      uint64_t reservedSpace1:2;
      uint64_t RF_OSC_EN:4;
      uint64_t RADIO_GASKET_BYPASS_OVRD_EN:1;
      uint64_t RADIO_GASKET_BYPASS_OVRD:1;
      uint64_t reservedSpace2:4;
      uint64_t RADIO_RAM_ACCESS_OVRD_EN:1;
      uint64_t RADIO_RAM_ACCESS_OVRD:1;
      uint64_t RSIM_DSM_EXIT:1;
      uint64_t reservedSpace3:1;
      uint64_t RSIM_STOP_ACK_OVRD_EN:1;
      uint64_t RSIM_STOP_ACK_OVRD:1;
      uint64_t RF_OSC_READY:1;
      uint64_t RF_OSC_READY_OVRD_EN:1;
      uint64_t RF_OSC_READY_OVRD:1;
      uint64_t reservedSpace4:1;
      uint64_t BLOCK_SOC_RESETS:1;
      uint64_t BLOCK_RADIO_OUTPUTS:1;
      uint64_t ALLOW_DFT_RESETS:1;
      uint64_t RADIO_RESET_BIT:1;
    } __attribute__((packed)) B;
  } CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FINE_DELAY:6;
      uint64_t reservedSpace0:10;
      uint64_t COARSE_DELAY:4;
      uint64_t reservedSpace1:4;
      uint64_t ACTIVE_WARNING:6;
    } __attribute__((packed)) B;
  } DSM_WAKEUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAC_ADDR_MSB:8;
    } __attribute__((packed)) B;
  } MAC_MSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAC_ADDR_LSB:32;
    } __attribute__((packed)) B;
  } MAC_LSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RADIO_VERSION:8;
    } __attribute__((packed)) B;
  } MISC;

