iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADIO_CONFIGURED_POR_RESET:1;
      uint64_t RADIO_CONFIGURED_SYS_RESET:1;
      uint64_t reservedSpace0:2;
      uint64_t RSIM_RF_ACTIVE_OVRD:1;
      uint64_t RSIM_RF_ACTIVE_OVRD_EN:1;
      uint64_t RF_OSC_EN_OVRD:1;
      uint64_t RF_OSC_EN_OVRD_EN:1;
      uint64_t IPP_IBE_RF_NOT_ALLOWED:1;
      uint64_t IPP_IBE_RF_EXT_OSC_EN:1;
      uint64_t IPP_IBE_DFT_RESET:1;
      uint64_t IPP_OBE_RF_OSC_EN:1;
      uint64_t RADIO_RF_NOT_ALLOWED_SEL:1;
      uint64_t RADIO_DFT_RESET_SEL:1;
      uint64_t RADIO_BLE_EARLY_WARNING_SEL:1;
      uint64_t reservedSpace1:1;
      uint64_t WIFI_COEXIST_1:1;
      uint64_t WIFI_COEXIST_2:1;
      uint64_t WIFI_COEXIST_3:1;
      uint64_t reservedSpace2:1;
      uint64_t RF_ACTIVE_ENDS_WITH_TSM:1;
      uint64_t SW_RF_ACTIVE_ENDS_WITH_TSM:1;
      uint64_t SW_RF_ACTIVE_BIT:1;
      uint64_t SW_RF_ACTIVE_EN:1;
      uint64_t IPP_OBE_RF_PRIORITY:1;
      uint64_t IPP_OBE_RF_STATUS:1;
      uint64_t IPP_OBE_RF_ACTIVE:1;
      uint64_t IPP_OBE_BLE_EARLY_WARNING:1;
      uint64_t reservedSpace3:3;
      uint64_t BLOCK_EXT_OSC_PWR_REQ:1;
    } __attribute__((packed)) B;
  } SW_CONFIG;

  uint8_t res1[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSM_TIMER:24;
    } __attribute__((packed)) B;
  } DSM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DSM_GEN_READY:1;
      uint64_t GEN_DEEP_SLEEP_STATUS:1;
      uint64_t DSM_GEN_FINISHED:1;
      uint64_t GEN_SYSCLK_REQUEST_EN:1;
      uint64_t GEN_SLEEP_REQUEST:1;
      uint64_t GEN_SYSCLK_REQ:1;
      uint64_t GEN_SYSCLK_INTERRUPT_EN:1;
      uint64_t GEN_SYSCLK_REQ_INT:1;
      uint64_t GEN_FSM_STATE:5;
      uint64_t reservedSpace1:6;
      uint64_t DSM_TIMER_CLR:1;
      uint64_t reservedSpace2:3;
      uint64_t DSM_TIMER_EN:1;
    } __attribute__((packed)) B;
  } DSM_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSM_OSC_STABILIZE_TIME:10;
    } __attribute__((packed)) B;
  } DSM_OSC_OFFSET;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN_SLEEP_TIME:24;
    } __attribute__((packed)) B;
  } GEN_SLEEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN_WAKE_TIME:24;
    } __attribute__((packed)) B;
  } GEN_WAKE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_XTAL_ALC_COUNT_SEL:2;
      uint64_t BB_XTAL_ALC_ON:1;
      uint64_t RF_OSC_BYPASS_EN:1;
      uint64_t BB_XTAL_COMP_BIAS:5;
      uint64_t BB_XTAL_DC_COUP_MODE_EN:1;
      uint64_t BB_XTAL_DIAGSEL:1;
      uint64_t BB_XTAL_DIG_CLK_ON:1;
      uint64_t BB_XTAL_GM:5;
      uint64_t BB_XTAL_ON_OVRD:1;
      uint64_t BB_XTAL_ON_OVRD_ON:1;
      uint64_t reservedSpace0:1;
      uint64_t BB_XTAL_READY_COUNT_SEL:2;
      uint64_t reservedSpace1:5;
      uint64_t RADIO_EXT_OSC_RF_EN_SEL:1;
      uint64_t RADIO_EXT_OSC_OVRD:1;
      uint64_t RADIO_EXT_OSC_OVRD_EN:1;
      uint64_t RF_NOT_ALLOWED_OVRD:1;
      uint64_t RF_NOT_ALLOWED_OVRD_EN:1;
    } __attribute__((packed)) B;
  } RF_OSC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t XTAL_OUT_BUF_EN:1;
    } __attribute__((packed)) B;
  } ANA_TEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_LS_SPARE:2;
      uint64_t reservedSpace0:1;
      uint64_t BB_LDO_LS_TRIM:3;
      uint64_t BB_LDO_XO_SPARE:2;
      uint64_t BB_LDO_XO_TRIM:3;
      uint64_t BB_XTAL_SPARE:5;
      uint64_t BB_XTAL_TRIM:8;
      uint64_t BG_1V_TRIM:4;
      uint64_t BG_IBIAS_5U_TRIM:4;
    } __attribute__((packed)) B;
  } ANA_TRIM;

} __attribute__((packed));

#define RSIM (*(volatile struct RSIM_tag *) 0x40059000)

struct DCDC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DCDC_DISABLE_AUTO_CLK_SWITCH:1;
      uint64_t DCDC_SEL_CLK:1;
      uint64_t DCDC_PWD_OSC_INT:1;
      uint64_t reservedSpace1:5;
      uint64_t DCDC_LP_DF_CMP_ENABLE:1;
      uint64_t DCDC_IN_DIV_CTRL:2;
      uint64_t reservedSpace2:5;
      uint64_t DCDC_LP_STATE_HYS_L:2;
      uint64_t DCDC_LP_STATE_HYS_H:2;
      uint64_t HYST_LP_COMP_ADJ:1;
      uint64_t HYST_LP_CMP_DISABLE:1;
      uint64_t OFFSET_RSNS_LP_ADJ:1;
      uint64_t OFFSET_RSNS_LP_DISABLE:1;
      uint64_t DCDC_LESS_I:1;
      uint64_t PWD_CMP_OFFSET:1;
      uint64_t DCDC_XTALOK_DISABLE:1;
      uint64_t PSWITCH_STATUS:1;
      uint64_t VLPS_CONFIG_DCDC_HP:1;
      uint64_t VLPR_VLPW_CONFIG_DCDC_HP:1;
      uint64_t DCDC_STS_DC_OK:1;
    } __attribute__((packed)) B;
  } DCDC_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSLIMIT_BUCK_IN:7;
      uint64_t reservedSpace0:14;
      uint64_t DCDC_LOOPCTRL_CM_HST_THRESH:1;
      uint64_t DCDC_LOOPCTRL_DF_HST_THRESH:1;
      uint64_t DCDC_LOOPCTRL_EN_CM_HYST:1;
      uint64_t DCDC_LOOPCTRL_EN_DF_HYST:1;
    } __attribute__((packed)) B;
  } DCDC_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t DCDC_LOOPCTRL_EN_RCSCALE:2;
      uint64_t reservedSpace1:2;
      uint64_t DCDC_LOOPCTRL_HYST_SIGN:1;
      uint64_t reservedSpace2:1;
      uint64_t DCDC_BATTMONITOR_EN_BATADJ:1;
      uint64_t DCDC_BATTMONITOR_BATT_VAL:10;
    } __attribute__((packed)) B;
  } DCDC_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_VDD1P8CTRL_TRG:6;
      uint64_t DCDC_VDD1P5CTRL_TRG_BUCK:5;
      uint64_t reservedSpace0:6;
      uint64_t DCDC_VDD1P5CTRL_ADJTN:4;
      uint64_t DCDC_MINPWR_DC_HALFCLK_PULSED:1;
      uint64_t DCDC_MINPWR_DOUBLE_FETS_PULSED:1;
      uint64_t DCDC_MINPWR_HALF_FETS_PULSED:1;
      uint64_t DCDC_MINPWR_DC_HALFCLK:1;
      uint64_t DCDC_MINPWR_DOUBLE_FETS:1;
      uint64_t DCDC_MINPWR_HALF_FETS:1;
      uint64_t reservedSpace1:2;
      uint64_t DCDC_VDD1P5CTRL_DISABLE_STEP:1;
      uint64_t DCDC_VDD1P8CTRL_DISABLE_STEP:1;
    } __attribute__((packed)) B;
  } DCDC_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_SW_SHUTDOWN:1;
      uint64_t reservedSpace0:15;
      uint64_t UNLOCK:16;
    } __attribute__((packed)) B;
  } DCDC_REG4;

