iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSWITCH_INT_RISE_EN:1;
      uint64_t PSWITCH_INT_FALL_EN:1;
      uint64_t PSWITCH_INT_CLEAR:1;
      uint64_t PSWITCH_INT_MUTE:1;
      uint64_t reservedSpace0:27;
      uint64_t PSWITCH_INT_STS:1;
    } __attribute__((packed)) B;
  } DCDC_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEGRATOR_VALUE:19;
      uint64_t INTEGRATOR_VALUE_SEL:1;
      uint64_t PULSE_RUN_SPEEDUP:1;
    } __attribute__((packed)) B;
  } DCDC_REG7;

} __attribute__((packed));

#define DCDC (*(volatile struct DCDC_tag *) 0x4005a000)

struct BTLE_RF_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BLE_PART_ID:16;
    } __attribute__((packed)) B;
  } BLE_PART_ID;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ORF_SYSCLK_REQ:1;
      uint64_t RIF_LL_ACTIVE:1;
      uint64_t XCVR_BUSY:1;
    } __attribute__((packed)) B;
  } DSM_STATUS;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSM_INTR_EN:1;
      uint64_t BLE_FSM_SEL:3;
    } __attribute__((packed)) B;
  } MISC_CTRL;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VAR_CS:5;
      uint64_t BTLE_TX_EN:1;
      uint64_t BTLE_RX_EN:1;
      uint64_t TX_CS:5;
      uint64_t RX_CS:4;
    } __attribute__((packed)) B;
  } BLE_FSM;

} __attribute__((packed));

#define BTLE_RF (*(volatile struct BTLE_RF_tag *) 0x4005b600)

struct XCVR_RX_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ADC_NEGEDGE:1;
      uint64_t RX_CH_FILT_BYPASS:1;
      uint64_t reservedSpace0:1;
      uint64_t RX_ADC_POL:1;
      uint64_t RX_DEC_FILT_OSR:3;
      uint64_t reservedSpace1:1;
      uint64_t RX_FSK_ZB_SEL:1;
      uint64_t RX_NORM_EN:1;
      uint64_t RX_RSSI_EN:1;
      uint64_t RX_AGC_EN:1;
      uint64_t RX_DCOC_EN:1;
      uint64_t RX_DCOC_CAL_EN:1;
      uint64_t RX_IQ_SWAP:1;
      uint64_t RX_DC_RESID_EN:1;
      uint64_t RX_SRC_EN:1;
      uint64_t RX_SRC_RATE:1;
      uint64_t RX_DMA_DTEST_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t RX_DEC_FILT_GAIN:5;
      uint64_t RX_DEC_FILT_HZD_CORR_DIS:1;
      uint64_t reservedSpace3:2;
      uint64_t RX_DEC_FILT_HAZARD:1;
      uint64_t RX_RSSI_FILT_HAZARD:1;
      uint64_t RX_DEC_FILT_SAT_I:1;
      uint64_t RX_DEC_FILT_SAT_Q:1;
    } __attribute__((packed)) B;
  } RX_DIG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOW_AGC_EN:1;
      uint64_t SLOW_AGC_SRC:2;
      uint64_t AGC_FREEZE_EN:1;
      uint64_t AGC_FREEZE_PRE_OR_AA:1;
      uint64_t reservedSpace0:1;
      uint64_t AGC_UP_EN:1;
      uint64_t AGC_UP_SRC:1;
      uint64_t AGC_DOWN_BBA_STEP_SZ:4;
      uint64_t AGC_DOWN_LNA_STEP_SZ:4;
      uint64_t AGC_UP_RSSI_THRESH:8;
      uint64_t AGC_DOWN_RSSI_THRESH:8;
    } __attribute__((packed)) B;
  } AGC_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESLOW_UP_THRESH:4;
      uint64_t PRESLOW_DOWN_THRESH:4;
      uint64_t reservedSpace0:4;
      uint64_t LNA_USER_GAIN:4;
      uint64_t BBA_USER_GAIN:4;
      uint64_t USER_LNA_GAIN_EN:1;
      uint64_t USER_BBA_GAIN_EN:1;
      uint64_t PRESLOW_EN:1;
      uint64_t PDET_HI_SEL_HOLD:1;
      uint64_t LNA_GAIN_SETTLE_TIME:8;
    } __attribute__((packed)) B;
  } AGC_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_PDET_RST:1;
      uint64_t TZA_PDET_RST:1;
      uint64_t MAN_PDET_RST:1;
      uint64_t reservedSpace0:1;
      uint64_t BBA_GAIN_SETTLE_TIME:8;
      uint64_t BBA_PDET_SEL_LO:3;
      uint64_t BBA_PDET_SEL_HI:3;
      uint64_t TZA_PDET_SEL_LO:3;
      uint64_t TZA_PDET_SEL_HI:3;
      uint64_t AGC_FAST_EXPIRE:6;
      uint64_t LNA_LG_ON_OVR:1;
      uint64_t LNA_HG_ON_OVR:1;
    } __attribute__((packed)) B;
  } AGC_CTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AGC_UNFREEZE_TIME:13;
      uint64_t AGC_PDET_LO_DLY:3;
      uint64_t AGC_RSSI_DELT_H2S:7;
      uint64_t AGC_H2S_STEP_SZ:5;
      uint64_t AGC_UP_STEP_SZ:4;
    } __attribute__((packed)) B;
  } AGC_CTRL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_PDET_LO_STAT:1;
      uint64_t BBA_PDET_HI_STAT:1;
      uint64_t TZA_PDET_LO_STAT:1;
      uint64_t TZA_PDET_HI_STAT:1;
      uint64_t CURR_AGC_IDX:5;
      uint64_t AGC_FROZEN:1;
      uint64_t AGC_IDX_AA_MATCH:5;
      uint64_t reservedSpace0:1;
      uint64_t RSSI_ADC_RAW:8;
    } __attribute__((packed)) B;
  } AGC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSSI_USE_VALS:1;
      uint64_t RSSI_HOLD_SRC:2;
      uint64_t RSSI_HOLD_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RSSI_IIR_CW_WEIGHT:2;
      uint64_t RSSI_N_WINDOW_NB:3;
      uint64_t RSSI_HOLD_DELAY:6;
      uint64_t RSSI_IIR_WEIGHT:4;
      uint64_t RSSI_VLD_SETTLE:3;
      uint64_t reservedSpace1:1;
      uint64_t RSSI_ADJ:8;
    } __attribute__((packed)) B;
  } RSSI_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RSSI_OUT:8;
    } __attribute__((packed)) B;
  } RSSI_CTRL_1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_MIDPWR_TRK_DIS:1;
      uint64_t DCOC_MAN:1;
      uint64_t DCOC_TRK_EST_OVR:1;
      uint64_t DCOC_CORRECT_SRC:1;
      uint64_t DCOC_CORRECT_EN:1;
      uint64_t TRACK_FROM_ZERO:1;
      uint64_t BBA_CORR_POL:1;
      uint64_t TZA_CORR_POL:1;
      uint64_t DCOC_CAL_DURATION:5;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_CAL_CHECK_EN:1;
      uint64_t DCOC_CORR_DLY:5;
      uint64_t reservedSpace1:3;
      uint64_t DCOC_CORR_HOLD_TIME:7;
    } __attribute__((packed)) B;
  } DCOC_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_SIGN_SCALE_IDX:2;
      uint64_t DCOC_ALPHAC_SCALE_IDX:3;
      uint64_t DCOC_ALPHA_RADIUS_IDX:3;
      uint64_t reservedSpace0:4;
      uint64_t DCOC_TRK_EST_GS_CNT:3;
      uint64_t reservedSpace1:1;
      uint64_t DCOC_SIGN_SCALE_GS_IDX:2;
      uint64_t DCOC_ALPHAC_SCALE_GS_IDX:3;
      uint64_t DCOC_ALPHA_RADIUS_GS_IDX:3;
      uint64_t DCOC_TRK_MIN_AGC_IDX:5;
    } __attribute__((packed)) B;
  } DCOC_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_DCOC_INIT_I:6;
      uint64_t reservedSpace0:2;
      uint64_t BBA_DCOC_INIT_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t TZA_DCOC_INIT_I:8;
      uint64_t TZA_DCOC_INIT_Q:8;
    } __attribute__((packed)) B;
  } DCOC_DAC_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIG_DCOC_INIT_I:12;
      uint64_t reservedSpace0:4;
      uint64_t DIG_DCOC_INIT_Q:12;
    } __attribute__((packed)) B;
  } DCOC_DIG_MAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DCOC_BBA_CAL_GAIN1:4;
      uint64_t DCOC_LNA_CAL_GAIN1:4;
      uint64_t DCOC_BBA_CAL_GAIN2:4;
      uint64_t DCOC_LNA_CAL_GAIN2:4;
      uint64_t DCOC_BBA_CAL_GAIN3:4;
      uint64_t DCOC_LNA_CAL_GAIN3:4;
    } __attribute__((packed)) B;
  } DCOC_CAL_GAIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_DCOC_I:6;
      uint64_t reservedSpace0:1;
      uint64_t DCOC_CAL_GTWSR:1;
      uint64_t BBA_DCOC_Q:6;
      uint64_t DCOC_CAL_RESULT:2;
      uint64_t TZA_DCOC_I:8;
      uint64_t TZA_DCOC_Q:8;
    } __attribute__((packed)) B;
  } DCOC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC_EST_I:12;
      uint64_t reservedSpace0:4;
      uint64_t DC_EST_Q:12;
    } __attribute__((packed)) B;
  } DCOC_DC_EST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TMP_CALC_RECIP:11;
      uint64_t reservedSpace0:5;
      uint64_t ALPHA_CALC_RECIP:11;
    } __attribute__((packed)) B;
  } DCOC_CAL_RCP;

