iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IQMC_CAL_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t IQMC_NUM_ITER:8;
      uint64_t IQMC_DC_GAIN_ADJ:11;
    } __attribute__((packed)) B;
  } IQMC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IQMC_GAIN_ADJ:11;
      uint64_t reservedSpace0:5;
      uint64_t IQMC_PHASE_ADJ:12;
    } __attribute__((packed)) B;
  } IQMC_CAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_VAL_0:8;
      uint64_t LNA_GAIN_VAL_1:8;
      uint64_t LNA_GAIN_VAL_2:8;
      uint64_t LNA_GAIN_VAL_3:8;
    } __attribute__((packed)) B;
  } LNA_GAIN_VAL_3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_VAL_4:8;
      uint64_t LNA_GAIN_VAL_5:8;
      uint64_t LNA_GAIN_VAL_6:8;
      uint64_t LNA_GAIN_VAL_7:8;
    } __attribute__((packed)) B;
  } LNA_GAIN_VAL_7_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_VAL_8:8;
      uint64_t LNA_GAIN_VAL_9:8;
    } __attribute__((packed)) B;
  } LNA_GAIN_VAL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RES_TUNE_VAL_0:4;
      uint64_t BBA_RES_TUNE_VAL_1:4;
      uint64_t BBA_RES_TUNE_VAL_2:4;
      uint64_t BBA_RES_TUNE_VAL_3:4;
      uint64_t BBA_RES_TUNE_VAL_4:4;
      uint64_t BBA_RES_TUNE_VAL_5:4;
      uint64_t BBA_RES_TUNE_VAL_6:4;
      uint64_t BBA_RES_TUNE_VAL_7:4;
    } __attribute__((packed)) B;
  } BBA_RES_TUNE_VAL_7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RES_TUNE_VAL_8:4;
      uint64_t BBA_RES_TUNE_VAL_9:4;
      uint64_t BBA_RES_TUNE_VAL_10:4;
    } __attribute__((packed)) B;
  } BBA_RES_TUNE_VAL_10_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_LIN_VAL_0:10;
      uint64_t LNA_GAIN_LIN_VAL_1:10;
      uint64_t LNA_GAIN_LIN_VAL_2:10;
    } __attribute__((packed)) B;
  } LNA_GAIN_LIN_VAL_2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_LIN_VAL_3:10;
      uint64_t LNA_GAIN_LIN_VAL_4:10;
      uint64_t LNA_GAIN_LIN_VAL_5:10;
    } __attribute__((packed)) B;
  } LNA_GAIN_LIN_VAL_5_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_LIN_VAL_6:10;
      uint64_t LNA_GAIN_LIN_VAL_7:10;
      uint64_t LNA_GAIN_LIN_VAL_8:10;
    } __attribute__((packed)) B;
  } LNA_GAIN_LIN_VAL_8_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_GAIN_LIN_VAL_9:10;
    } __attribute__((packed)) B;
  } LNA_GAIN_LIN_VAL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RES_TUNE_LIN_VAL_0:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_1:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_2:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_3:8;
    } __attribute__((packed)) B;
  } BBA_RES_TUNE_LIN_VAL_3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RES_TUNE_LIN_VAL_4:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_5:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_6:8;
      uint64_t BBA_RES_TUNE_LIN_VAL_7:8;
    } __attribute__((packed)) B;
  } BBA_RES_TUNE_LIN_VAL_7_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RES_TUNE_LIN_VAL_8:10;
      uint64_t BBA_RES_TUNE_LIN_VAL_9:10;
      uint64_t BBA_RES_TUNE_LIN_VAL_10:10;
    } __attribute__((packed)) B;
  } BBA_RES_TUNE_LIN_VAL_10_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_00:4;
      uint64_t LNA_GAIN_00:4;
      uint64_t BBA_GAIN_01:4;
      uint64_t LNA_GAIN_01:4;
      uint64_t BBA_GAIN_02:4;
      uint64_t LNA_GAIN_02:4;
      uint64_t BBA_GAIN_03:4;
      uint64_t LNA_GAIN_03:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_03_00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_04:4;
      uint64_t LNA_GAIN_04:4;
      uint64_t BBA_GAIN_05:4;
      uint64_t LNA_GAIN_05:4;
      uint64_t BBA_GAIN_06:4;
      uint64_t LNA_GAIN_06:4;
      uint64_t BBA_GAIN_07:4;
      uint64_t LNA_GAIN_07:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_07_04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_08:4;
      uint64_t LNA_GAIN_08:4;
      uint64_t BBA_GAIN_09:4;
      uint64_t LNA_GAIN_09:4;
      uint64_t BBA_GAIN_10:4;
      uint64_t LNA_GAIN_10:4;
      uint64_t BBA_GAIN_11:4;
      uint64_t LNA_GAIN_11:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_11_08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_12:4;
      uint64_t LNA_GAIN_12:4;
      uint64_t BBA_GAIN_13:4;
      uint64_t LNA_GAIN_13:4;
      uint64_t BBA_GAIN_14:4;
      uint64_t LNA_GAIN_14:4;
      uint64_t BBA_GAIN_15:4;
      uint64_t LNA_GAIN_15:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_15_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_16:4;
      uint64_t LNA_GAIN_16:4;
      uint64_t BBA_GAIN_17:4;
      uint64_t LNA_GAIN_17:4;
      uint64_t BBA_GAIN_18:4;
      uint64_t LNA_GAIN_18:4;
      uint64_t BBA_GAIN_19:4;
      uint64_t LNA_GAIN_19:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_19_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_20:4;
      uint64_t LNA_GAIN_20:4;
      uint64_t BBA_GAIN_21:4;
      uint64_t LNA_GAIN_21:4;
      uint64_t BBA_GAIN_22:4;
      uint64_t LNA_GAIN_22:4;
      uint64_t BBA_GAIN_23:4;
      uint64_t LNA_GAIN_23:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_23_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_GAIN_24:4;
      uint64_t LNA_GAIN_24:4;
      uint64_t BBA_GAIN_25:4;
      uint64_t LNA_GAIN_25:4;
      uint64_t BBA_GAIN_26:4;
      uint64_t LNA_GAIN_26:4;
    } __attribute__((packed)) B;
  } AGC_GAIN_TBL_26_24;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_BBA_OFFSET_I:6;
      uint64_t reservedSpace0:2;
      uint64_t DCOC_BBA_OFFSET_Q:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOC_TZA_OFFSET_I:8;
      uint64_t DCOC_TZA_OFFSET_Q:8;
    } __attribute__((packed)) B;
  } DCOC_OFFSET_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_DCOC_STEP_RECIP:13;
      uint64_t reservedSpace0:3;
      uint64_t BBA_DCOC_STEP:9;
    } __attribute__((packed)) B;
  } DCOC_BBA_STEP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_0:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_0:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_1:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_1:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_2:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_2:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_3:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_3:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_4:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_4:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_5:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_5:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_6:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_6:12;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_7:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_7:13;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_8:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_8:13;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_9:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_9:14;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_TZA_STEP_RCP_10:13;
      uint64_t reservedSpace0:3;
      uint64_t DCOC_TZA_STEP_GAIN_10:14;
    } __attribute__((packed)) B;
  } DCOC_TZA_STEP_10;

  uint8_t res3[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_BETA_F_TH:11;
      uint64_t reservedSpace0:5;
      uint64_t DCOC_CAL_ALPHA_F_TH:10;
    } __attribute__((packed)) B;
  } DCOC_CAL_FAIL_TH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_BETA_P_TH:11;
      uint64_t reservedSpace0:5;
      uint64_t DCOC_CAL_ALPHA_P_TH:10;
    } __attribute__((packed)) B;
  } DCOC_CAL_PASS_TH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_ALPHA_I:11;
      uint64_t reservedSpace0:5;
      uint64_t DCOC_CAL_ALPHA_Q:11;
    } __attribute__((packed)) B;
  } DCOC_CAL_ALPHA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_BETA_Q:17;
    } __attribute__((packed)) B;
  } DCOC_CAL_BETA_Q;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_BETA_I:17;
    } __attribute__((packed)) B;
  } DCOC_CAL_BETA_I;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_GAMMA_I:16;
      uint64_t DCOC_CAL_GAMMA_Q:16;
    } __attribute__((packed)) B;
  } DCOC_CAL_GAMMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_IIR1A_IDX:2;
      uint64_t DCOC_CAL_IIR2A_IDX:2;
      uint64_t DCOC_CAL_IIR3A_IDX:2;
    } __attribute__((packed)) B;
  } DCOC_CAL_IIR;

