iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_RES_I:12;
      uint64_t reservedSpace0:4;
      uint64_t DCOC_CAL_RES_Q:12;
    } __attribute__((packed)) B;
  } DCOC_CAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_RES_I:12;
      uint64_t reservedSpace0:4;
      uint64_t DCOC_CAL_RES_Q:12;
    } __attribute__((packed)) B;
  } DCOC_CAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOC_CAL_RES_I:12;
      uint64_t reservedSpace0:4;
      uint64_t DCOC_CAL_RES_Q:12;
    } __attribute__((packed)) B;
  } DCOC_CAL3;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LQI_CORR_THRESH:8;
      uint64_t CORR_CNTR_THRESH:8;
      uint64_t LQI_CNTR:8;
      uint64_t SNR_ADJ:6;
    } __attribute__((packed)) B;
  } CCA_ED_LQI_CTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSSI_NOISE_AVG_DELAY:6;
      uint64_t RSSI_NOISE_AVG_FACTOR:3;
      uint64_t LQI_RSSI_WEIGHT:3;
      uint64_t LQI_RSSI_SENS:4;
      uint64_t SNR_LQI_DIS:1;
      uint64_t reservedSpace0:1;
      uint64_t MEAS_TRANS_TO_IDLE:1;
      uint64_t CCA1_ED_EN_DIS:1;
      uint64_t MAN_MEAS_COMPLETE:1;
      uint64_t MAN_AA_MATCH:1;
      uint64_t reservedSpace1:2;
      uint64_t SNR_LQI_WEIGHT:4;
      uint64_t LQI_BIAS:4;
    } __attribute__((packed)) B;
  } CCA_ED_LQI_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LQI_OUT:8;
      uint64_t ED_OUT:8;
      uint64_t SNR_OUT:8;
      uint64_t CCA1_STATE:1;
      uint64_t MEAS_COMPLETE:1;
    } __attribute__((packed)) B;
  } CCA_ED_LQI_STAT_0;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H0:6;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H1:6;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H2:7;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H3:7;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H4:7;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H5:7;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H6:8;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H7:8;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H8:9;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H9:9;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H10:10;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_CH_FILT_H11:10;
    } __attribute__((packed)) B;
  } RX_CHF_COEF_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t AGC_MAN_IDX:5;
      uint64_t reservedSpace1:3;
      uint64_t AGC_MAN_IDX_EN:1;
      uint64_t AGC_DCOC_START_PT:1;
    } __attribute__((packed)) B;
  } AGC_MAN_AGC_IDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC_RESID_NWIN:7;
      uint64_t reservedSpace0:1;
      uint64_t DC_RESID_ITER_FREEZE:4;
      uint64_t DC_RESID_ALPHA:3;
      uint64_t reservedSpace1:1;
      uint64_t DC_RESID_DLY:3;
      uint64_t reservedSpace2:1;
      uint64_t DC_RESID_EXT_DC_EN:1;
      uint64_t reservedSpace3:3;
      uint64_t DC_RESID_MIN_AGC_IDX:5;
    } __attribute__((packed)) B;
  } DC_RESID_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC_RESID_OFFSET_I:13;
      uint64_t reservedSpace0:3;
      uint64_t DC_RESID_OFFSET_Q:13;
    } __attribute__((packed)) B;
  } DC_RESID_EST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BBA_RCCAL_OFFSET:4;
      uint64_t BBA_RCCAL_MANUAL:5;
      uint64_t BBA_RCCAL_DIS:1;
      uint64_t reservedSpace0:2;
      uint64_t RCCAL_SMP_DLY:2;
      uint64_t reservedSpace1:1;
      uint64_t RCCAL_COMP_INV:1;
      uint64_t TZA_RCCAL_OFFSET:4;
      uint64_t TZA_RCCAL_MANUAL:5;
      uint64_t TZA_RCCAL_DIS:1;
    } __attribute__((packed)) B;
  } RX_RCCAL_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_RCCAL_OFFSET:4;
      uint64_t ADC_RCCAL_MANUAL:5;
      uint64_t ADC_RCCAL_DIS:1;
      uint64_t reservedSpace0:6;
      uint64_t BBA2_RCCAL_OFFSET:4;
      uint64_t BBA2_RCCAL_MANUAL:5;
      uint64_t BBA2_RCCAL_DIS:1;
    } __attribute__((packed)) B;
  } RX_RCCAL_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCCAL_CODE:5;
      uint64_t ADC_RCCAL:5;
      uint64_t BBA2_RCCAL:5;
      uint64_t reservedSpace0:1;
      uint64_t BBA_RCCAL:5;
      uint64_t TZA_RCCAL:5;
    } __attribute__((packed)) B;
  } RX_RCCAL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAC_CAL_ADJUST_MANUAL:7;
      uint64_t AUXPLL_DAC_CAL_ADJUST_DIS:1;
      uint64_t FCAL_RUN_CNT:1;
      uint64_t FCAL_COMP_INV:1;
      uint64_t FCAL_SMP_DLY:2;
      uint64_t reservedSpace0:4;
      uint64_t DAC_CAL_ADJUST:7;
    } __attribute__((packed)) B;
  } AUXPLL_FCAL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAL_COUNT_6:10;
      uint64_t reservedSpace0:6;
      uint64_t FCAL_BESTDIFF:10;
    } __attribute__((packed)) B;
  } AUXPLL_FCAL_CNT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAL_COUNT_4:10;
      uint64_t reservedSpace0:6;
      uint64_t FCAL_COUNT_5:10;
    } __attribute__((packed)) B;
  } AUXPLL_FCAL_CNT5_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAL_COUNT_2:10;
      uint64_t reservedSpace0:6;
      uint64_t FCAL_COUNT_3:10;
    } __attribute__((packed)) B;
  } AUXPLL_FCAL_CNT3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAL_COUNT_0:10;
      uint64_t reservedSpace0:6;
      uint64_t FCAL_COUNT_1:10;
    } __attribute__((packed)) B;
  } AUXPLL_FCAL_CNT1_0;

} __attribute__((packed));

#define XCVR_RX_DIG (*(volatile struct XCVR_RX_DIG_tag *) 0x4005c000)

struct XCVR_TX_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADIO_DFT_MODE:4;
      uint64_t LFSR_LENGTH:3;
      uint64_t LFSR_EN:1;
      uint64_t DFT_CLK_SEL:3;
      uint64_t TX_DFT_EN:1;
      uint64_t SOC_TEST_SEL:2;
      uint64_t reservedSpace0:2;
      uint64_t TX_CAPTURE_POL:1;
      uint64_t reservedSpace1:2;
      uint64_t ZERO_FDEV:1;
      uint64_t reservedSpace2:2;
      uint64_t FREQ_WORD_ADJ:10;
    } __attribute__((packed)) B;
  } CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_PADDING_PAT_0:8;
      uint64_t DATA_PADDING_PAT_1:8;
      uint64_t DFT_LFSR_OUT:15;
      uint64_t LRM:1;
    } __attribute__((packed)) B;
  } DATA_PADDING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GFSK_MULTIPLY_TABLE_MANUAL:16;
      uint64_t GFSK_MI:2;
      uint64_t reservedSpace0:2;
      uint64_t GFSK_MLD:1;
      uint64_t GFSK_FLD:1;
      uint64_t reservedSpace1:2;
      uint64_t GFSK_MOD_INDEX_SCALING:3;
      uint64_t reservedSpace2:1;
      uint64_t TX_IMAGE_FILTER_OVRD_EN:1;
      uint64_t TX_IMAGE_FILTER_0_OVRD:1;
      uint64_t TX_IMAGE_FILTER_1_OVRD:1;
      uint64_t TX_IMAGE_FILTER_2_OVRD:1;
    } __attribute__((packed)) B;
  } GFSK_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GFSK_FILTER_COEFF_MANUAL2:32;
    } __attribute__((packed)) B;
  } GFSK_COEFF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GFSK_FILTER_COEFF_MANUAL1:32;
    } __attribute__((packed)) B;
  } GFSK_COEFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSK_MODULATION_SCALE_0:13;
      uint64_t reservedSpace0:3;
      uint64_t FSK_MODULATION_SCALE_1:13;
      uint64_t reservedSpace1:2;
      uint64_t FSK_BITRATE_SCALE_DISABLE:1;
    } __attribute__((packed)) B;
  } FSK_SCALE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_MOD_PATTERN:32;
    } __attribute__((packed)) B;
  } DFT_PATTERN;

} __attribute__((packed));

#define XCVR_TX_DIG (*(volatile struct XCVR_TX_DIG_tag *) 0x4005c200)

