iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
struct XCVR_PLL_DIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPM_VCM_TX:3;
      uint64_t reservedSpace0:1;
      uint64_t HPM_VCM_CAL:3;
      uint64_t reservedSpace1:1;
      uint64_t HPM_FDB_RES_TX:2;
      uint64_t reservedSpace2:2;
      uint64_t HPM_FDB_RES_CAL:2;
    } __attribute__((packed)) B;
  } HPM_BUMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_WORD_MANUAL:13;
      uint64_t reservedSpace0:2;
      uint64_t MOD_DISABLE:1;
      uint64_t HPM_MOD_MANUAL:8;
      uint64_t reservedSpace1:3;
      uint64_t HPM_MOD_DISABLE:1;
      uint64_t HPM_SDM_OUT_MANUAL:2;
      uint64_t reservedSpace2:1;
      uint64_t HPM_SDM_OUT_DISABLE:1;
    } __attribute__((packed)) B;
  } MOD_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_NUM:7;
      uint64_t reservedSpace0:1;
      uint64_t BOC:1;
      uint64_t BMR:1;
      uint64_t reservedSpace1:6;
      uint64_t HOP_TBL_CFG_OVRD:3;
      uint64_t HOP_TBL_CFG_OVRD_EN:1;
    } __attribute__((packed)) B;
  } CHAN_MAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT_FAIL:1;
      uint64_t CTFF:1;
      uint64_t CS_FAIL:1;
      uint64_t CSFF:1;
      uint64_t FT_FAIL:1;
      uint64_t FTFF:1;
      uint64_t reservedSpace0:1;
      uint64_t TAFF:1;
      uint64_t CTUNE_LDF_LEV:4;
      uint64_t FTF_RX_THRSH:6;
      uint64_t reservedSpace1:1;
      uint64_t FTW_RX:1;
      uint64_t FTF_TX_THRSH:6;
      uint64_t reservedSpace2:1;
      uint64_t FTW_TX:1;
      uint64_t FREQ_COUNT_GO:1;
      uint64_t FREQ_COUNT_FINISHED:1;
      uint64_t FREQ_COUNT_TIME:2;
    } __attribute__((packed)) B;
  } LOCK_DETECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPM_SDM_IN_MANUAL:10;
      uint64_t reservedSpace0:3;
      uint64_t HPFF:1;
      uint64_t HPM_SDM_OUT_INVERT:1;
      uint64_t HPM_SDM_IN_DISABLE:1;
      uint64_t HPM_LFSR_SIZE:3;
      uint64_t reservedSpace1:1;
      uint64_t HPM_DTH_SCL:1;
      uint64_t reservedSpace2:2;
      uint64_t HPM_DTH_EN:1;
      uint64_t HPM_INTEGER_SCALE:2;
      uint64_t reservedSpace3:1;
      uint64_t HPM_INTEGER_INVERT:1;
      uint64_t HPM_CAL_INVERT:1;
      uint64_t reservedSpace4:2;
      uint64_t HPM_MOD_IN_INVERT:1;
    } __attribute__((packed)) B;
  } HPM_CTRL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPM_NUM_SELECTED:10;
      uint64_t reservedSpace0:6;
      uint64_t HPM_DENOM:10;
      uint64_t reservedSpace1:2;
      uint64_t HPM_COUNT_ADJUST:4;
    } __attribute__((packed)) B;
  } HPM_SDM_RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_LD_MANUAL:5;
      uint64_t reservedSpace0:6;
      uint64_t PLL_LD_DISABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t LPFF:1;
      uint64_t LPM_SDM_INV:1;
      uint64_t LPM_DISABLE:1;
      uint64_t LPM_DTH_SCL:4;
      uint64_t reservedSpace2:2;
      uint64_t LPM_D_CTRL:1;
      uint64_t LPM_D_OVRD:1;
      uint64_t LPM_SCALE:4;
      uint64_t reservedSpace3:3;
      uint64_t LPM_SDM_USE_NEG:1;
    } __attribute__((packed)) B;
  } LPM_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_INTG_SELECTED:7;
      uint64_t reservedSpace0:1;
      uint64_t HPM_ARRAY_BIAS:7;
      uint64_t reservedSpace1:1;
      uint64_t LPM_INTG:7;
      uint64_t reservedSpace2:8;
      uint64_t SDM_MAP_DISABLE:1;
    } __attribute__((packed)) B;
  } LPM_SDM_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_NUM:28;
    } __attribute__((packed)) B;
  } LPM_SDM_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_DENOM:28;
    } __attribute__((packed)) B;
  } LPM_SDM_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_NUM_SELECTED:28;
    } __attribute__((packed)) B;
  } LPM_SDM_RES1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_DENOM_SELECTED:28;
    } __attribute__((packed)) B;
  } LPM_SDM_RES2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPM_SDM_DELAY:4;
      uint64_t reservedSpace0:4;
      uint64_t HPM_SDM_DELAY:4;
      uint64_t reservedSpace1:4;
      uint64_t HPM_INTEGER_DELAY:4;
    } __attribute__((packed)) B;
  } DELAY_MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTUNE_TARGET_MANUAL:12;
      uint64_t reservedSpace0:3;
      uint64_t CTUNE_TARGET_DISABLE:1;
      uint64_t CTUNE_ADJUST:4;
      uint64_t reservedSpace1:4;
      uint64_t CTUNE_MANUAL:7;
      uint64_t CTUNE_DISABLE:1;
    } __attribute__((packed)) B;
  } CTUNE_CTRL;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTUNE_SELECTED:7;
      uint64_t reservedSpace0:1;
      uint64_t CTUNE_BEST_DIFF:8;
      uint64_t CTUNE_FREQ_SELECTED:12;
    } __attribute__((packed)) B;
  } CTUNE_RES;

} __attribute__((packed));

#define XCVR_PLL_DIG (*(volatile struct XCVR_PLL_DIG_tag *) 0x4005c224)

struct XCVR_MISC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTOCOL:4;
      uint64_t TGT_PWR_SRC:3;
      uint64_t reservedSpace0:1;
      uint64_t REF_CLK_FREQ:2;
      uint64_t reservedSpace1:1;
      uint64_t SOC_RF_OSC_CLK_GATE_EN:1;
      uint64_t DEMOD_SEL:2;
      uint64_t reservedSpace2:2;
      uint64_t RADIO0_IRQ_SEL:3;
      uint64_t reservedSpace3:1;
      uint64_t RADIO1_IRQ_SEL:3;
      uint64_t reservedSpace4:1;
      uint64_t TSM_LL_INHIBIT:4;
    } __attribute__((packed)) B;
  } XCVR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_COUNT:8;
      uint64_t PLL_SEQ_STATE:4;
      uint64_t RX_MODE:1;
      uint64_t TX_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t BTLE_SYSCLK_REQ:1;
      uint64_t RIF_LL_ACTIVE:1;
      uint64_t XTAL_READY:1;
      uint64_t SOC_USING_RF_OSC_CLK:1;
      uint64_t reservedSpace1:4;
      uint64_t TSM_IRQ0:1;
      uint64_t TSM_IRQ1:1;
    } __attribute__((packed)) B;
  } XCVR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_RELINQUISH:1;
      uint64_t XCVR_BUSY:1;
    } __attribute__((packed)) B;
  } BLE_ARB_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVERWRITE_VER:8;
    } __attribute__((packed)) B;
  } OVERWRITE_VER;

