iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_PAGE:4;
      uint64_t DMA_EN:1;
      uint64_t BYPASS_DMA_SYNC:1;
      uint64_t DMA_AA_TRIGGERED:1;
      uint64_t DMA_TIMED_OUT:1;
      uint64_t DMA_TIMEOUT:4;
      uint64_t DMA_START_TRG:3;
      uint64_t DMA_START_EDGE:1;
      uint64_t DMA_START_TRIGGERED:1;
      uint64_t SINGLE_REQ_MODE:1;
    } __attribute__((packed)) B;
  } DMA_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_DATA:32;
    } __attribute__((packed)) B;
  } DMA_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_PAGE:4;
      uint64_t DBG_EN:1;
      uint64_t XCVR_RAM_PAGE:1;
      uint64_t XCVR_RAM_ALLOW:1;
      uint64_t ALL_PROTOCOLS_ALLOW:1;
      uint64_t DBG_RAM_FULL:2;
      uint64_t DBG_AA_TRIGGERED:1;
      uint64_t DBG_SOFT_INFO_SEL:1;
      uint64_t DBG_START_TRG:3;
      uint64_t DBG_START_EDGE:1;
      uint64_t DBG_STOP_TRG:4;
      uint64_t DBG_STOP_EDGE:1;
      uint64_t DBG_START_TRIGGERED:1;
      uint64_t DBG_STOP_TRIGGERED:1;
      uint64_t PB_PROTECT:1;
      uint64_t RAM0_CLK_ON_OVRD_EN:1;
      uint64_t RAM0_CLK_ON_OVRD:1;
      uint64_t RAM1_CLK_ON_OVRD_EN:1;
      uint64_t RAM1_CLK_ON_OVRD:1;
      uint64_t RAM0_CE_ON_OVRD_EN:1;
      uint64_t RAM0_CE_ON_OVRD:1;
      uint64_t RAM1_CE_ON_OVRD_EN:1;
      uint64_t RAM1_CE_ON_OVRD:1;
    } __attribute__((packed)) B;
  } PACKET_RAM_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM0_STOP_ADDR:11;
      uint64_t reservedSpace0:5;
      uint64_t RAM1_STOP_ADDR:11;
    } __attribute__((packed)) B;
  } RAM_STOP_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAD_EN:1;
      uint64_t ANTX:1;
      uint64_t reservedSpace0:2;
      uint64_t ANTX_EN:2;
      uint64_t ANTX_HZ:1;
      uint64_t ANTX_CTRLMODE:1;
      uint64_t ANTX_POL:4;
      uint64_t FAD_NOT_GPIO:4;
    } __attribute__((packed)) B;
  } FAD_CTRL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_NOT_ALLOWED_EN:4;
      uint64_t RF_NOT_ALLOWED_NO_TX:1;
      uint64_t RF_NOT_ALLOWED_NO_RX:1;
      uint64_t RF_NOT_ALLOWED_ASSERTED:1;
      uint64_t RF_NOT_ALLOWED_TX_ABORT:1;
      uint64_t RF_NOT_ALLOWED_RX_ABORT:1;
      uint64_t RF_NOT_ALLOWED:1;
      uint64_t reservedSpace0:6;
      uint64_t TSM_SPARE1_EXTEND:8;
    } __attribute__((packed)) B;
  } COEX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCW_EN:1;
      uint64_t CRCW_EC_EN:1;
      uint64_t CRC_ZERO:1;
      uint64_t CRC_EARLY_FAIL:1;
      uint64_t CRC_RES_OUT_VLD:1;
      uint64_t reservedSpace0:11;
      uint64_t CRC_EC_OFFSET:11;
      uint64_t reservedSpace1:1;
      uint64_t CRC_EC_DONE:1;
      uint64_t CRC_EC_FAIL:1;
    } __attribute__((packed)) B;
  } CRCW_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_EC_MASK:32;
    } __attribute__((packed)) B;
  } CRC_EC_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_RES_OUT:32;
    } __attribute__((packed)) B;
  } CRC_RES_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_EC_SPKT_BYTES:8;
      uint64_t CRC_EC_SPKT_WND:4;
      uint64_t CRC_EC_LPKT_WND:4;
    } __attribute__((packed)) B;
  } CRCW_CFG2;

} __attribute__((packed));

#define XCVR_MISC (*(volatile struct XCVR_MISC_tag *) 0x4005c280)

struct XCVR_TSM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSM_SOFT_RESET:1;
      uint64_t FORCE_TX_EN:1;
      uint64_t FORCE_RX_EN:1;
      uint64_t PA_RAMP_SEL:2;
      uint64_t DATA_PADDING_EN:2;
      uint64_t TSM_IRQ0_EN:1;
      uint64_t TSM_IRQ1_EN:1;
      uint64_t reservedSpace1:2;
      uint64_t RAMP_DN_DELAY:4;
      uint64_t TX_ABORT_DIS:1;
      uint64_t RX_ABORT_DIS:1;
      uint64_t ABORT_ON_CTUNE:1;
      uint64_t ABORT_ON_CYCLE_SLIP:1;
      uint64_t ABORT_ON_FREQ_TARG:1;
      uint64_t reservedSpace2:3;
      uint64_t BKPT:8;
    } __attribute__((packed)) B;
  } CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t END_OF_TX_WU:8;
      uint64_t END_OF_TX_WD:8;
      uint64_t END_OF_RX_WU:8;
      uint64_t END_OF_RX_WD:8;
    } __attribute__((packed)) B;
  } END_OF_SEQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_POWER:6;
    } __attribute__((packed)) B;
  } PA_POWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_RAMP0:6;
      uint64_t reservedSpace0:2;
      uint64_t PA_RAMP1:6;
      uint64_t reservedSpace1:2;
      uint64_t PA_RAMP2:6;
      uint64_t reservedSpace2:2;
      uint64_t PA_RAMP3:6;
    } __attribute__((packed)) B;
  } PA_RAMP_TBL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_RAMP4:6;
      uint64_t reservedSpace0:2;
      uint64_t PA_RAMP5:6;
      uint64_t reservedSpace1:2;
      uint64_t PA_RAMP6:6;
      uint64_t reservedSpace2:2;
      uint64_t PA_RAMP7:6;
    } __attribute__((packed)) B;
  } PA_RAMP_TBL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_RAMP8:6;
      uint64_t reservedSpace0:2;
      uint64_t PA_RAMP9:6;
      uint64_t reservedSpace1:2;
      uint64_t PA_RAMP10:6;
      uint64_t reservedSpace2:2;
      uint64_t PA_RAMP11:6;
    } __attribute__((packed)) B;
  } PA_RAMP_TBL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_RAMP12:6;
      uint64_t reservedSpace0:2;
      uint64_t PA_RAMP13:6;
      uint64_t reservedSpace1:2;
      uint64_t PA_RAMP14:6;
      uint64_t reservedSpace2:2;
      uint64_t PA_RAMP15:6;
    } __attribute__((packed)) B;
  } PA_RAMP_TBL3;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RECYCLE_COUNT0:8;
      uint64_t RECYCLE_COUNT1:8;
      uint64_t RECYCLE_COUNT2:8;
    } __attribute__((packed)) B;
  } RECYCLE_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAST_TX_WU_EN:1;
      uint64_t FAST_RX_WU_EN:1;
      uint64_t FAST_RX2TX_EN:1;
      uint64_t FAST_WU_CLEAR:1;
      uint64_t reservedSpace0:4;
      uint64_t FAST_RX2TX_START:8;
    } __attribute__((packed)) B;
  } FAST_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAST_START_TX:8;
      uint64_t FAST_DEST_TX:8;
      uint64_t FAST_START_RX:8;
      uint64_t FAST_DEST_RX:8;
    } __attribute__((packed)) B;
  } FAST_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_HF_EN_TX_HI:8;
      uint64_t BB_LDO_HF_EN_TX_LO:8;
      uint64_t BB_LDO_HF_EN_RX_HI:8;
      uint64_t BB_LDO_HF_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_ADCDAC_EN_TX_HI:8;
      uint64_t BB_LDO_ADCDAC_EN_TX_LO:8;
      uint64_t BB_LDO_ADCDAC_EN_RX_HI:8;
      uint64_t BB_LDO_ADCDAC_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t BB_LDO_BBA_EN_RX_HI:8;
      uint64_t BB_LDO_BBA_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_PD_EN_TX_HI:8;
      uint64_t BB_LDO_PD_EN_TX_LO:8;
      uint64_t BB_LDO_PD_EN_RX_HI:8;
      uint64_t BB_LDO_PD_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_FDBK_EN_TX_HI:8;
      uint64_t BB_LDO_FDBK_EN_TX_LO:8;
      uint64_t BB_LDO_FDBK_EN_RX_HI:8;
      uint64_t BB_LDO_FDBK_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_VCOLO_EN_TX_HI:8;
      uint64_t BB_LDO_VCOLO_EN_TX_LO:8;
      uint64_t BB_LDO_VCOLO_EN_RX_HI:8;
      uint64_t BB_LDO_VCOLO_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_VTREF_EN_TX_HI:8;
      uint64_t BB_LDO_VTREF_EN_TX_LO:8;
      uint64_t BB_LDO_VTREF_EN_RX_HI:8;
      uint64_t BB_LDO_VTREF_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_FDBK_BLEED_EN_TX_HI:8;
      uint64_t BB_LDO_FDBK_BLEED_EN_TX_LO:8;
      uint64_t BB_LDO_FDBK_BLEED_EN_RX_HI:8;
      uint64_t BB_LDO_FDBK_BLEED_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_VCOLO_BLEED_EN_TX_HI:8;
      uint64_t BB_LDO_VCOLO_BLEED_EN_TX_LO:8;
      uint64_t BB_LDO_VCOLO_BLEED_EN_RX_HI:8;
      uint64_t BB_LDO_VCOLO_BLEED_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_TX_HI:8;
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_TX_LO:8;
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_RX_HI:8;
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_XTAL_PLL_REF_CLK_EN_TX_HI:8;
      uint64_t BB_XTAL_PLL_REF_CLK_EN_TX_LO:8;
      uint64_t BB_XTAL_PLL_REF_CLK_EN_RX_HI:8;
      uint64_t BB_XTAL_PLL_REF_CLK_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_XTAL_DAC_REF_CLK_EN_TX_HI:8;
      uint64_t BB_XTAL_DAC_REF_CLK_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_VCO_REF_CLK_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_VCO_REF_CLK_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_LOOP_IS_OPEN_TX_HI:8;
      uint64_t PLL_LOOP_IS_OPEN_TX_LO:8;
      uint64_t PLL_LOOP_IS_OPEN_RX_HI:8;
      uint64_t PLL_LOOP_IS_OPEN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_PD_CYCLE_SLIP_LD_FT_EN_TX_HI:8;
      uint64_t SY_PD_CYCLE_SLIP_LD_FT_EN_TX_LO:8;
      uint64_t SY_PD_CYCLE_SLIP_LD_FT_EN_RX_HI:8;
      uint64_t SY_PD_CYCLE_SLIP_LD_FT_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_VCO_EN_TX_HI:8;
      uint64_t SY_VCO_EN_TX_LO:8;
      uint64_t SY_VCO_EN_RX_HI:8;
      uint64_t SY_VCO_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SY_LO_RX_BUF_EN_RX_HI:8;
      uint64_t SY_LO_RX_BUF_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_LO_TX_BUF_EN_TX_HI:8;
      uint64_t SY_LO_TX_BUF_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_DIVN_EN_TX_HI:8;
      uint64_t SY_DIVN_EN_TX_LO:8;
      uint64_t SY_DIVN_EN_RX_HI:8;
      uint64_t SY_DIVN_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_PD_FILTER_CHARGE_EN_TX_HI:8;
      uint64_t SY_PD_FILTER_CHARGE_EN_TX_LO:8;
      uint64_t SY_PD_FILTER_CHARGE_EN_RX_HI:8;
      uint64_t SY_PD_FILTER_CHARGE_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_PD_EN_TX_HI:8;
      uint64_t SY_PD_EN_TX_LO:8;
      uint64_t SY_PD_EN_RX_HI:8;
      uint64_t SY_PD_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_LO_DIVN_EN_TX_HI:8;
      uint64_t SY_LO_DIVN_EN_TX_LO:8;
      uint64_t SY_LO_DIVN_EN_RX_HI:8;
      uint64_t SY_LO_DIVN_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SY_LO_RX_EN_RX_HI:8;
      uint64_t SY_LO_RX_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_LO_TX_EN_TX_HI:8;
      uint64_t SY_LO_TX_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_DIVN_CAL_EN_TX_HI:8;
      uint64_t SY_DIVN_CAL_EN_TX_LO:8;
      uint64_t SY_DIVN_CAL_EN_RX_HI:8;
      uint64_t SY_DIVN_CAL_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_LNA_MIXER_EN_RX_HI:8;
      uint64_t RX_LNA_MIXER_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_PA_EN_TX_HI:8;
      uint64_t TX_PA_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_ADC_I_Q_EN_RX_HI:8;
      uint64_t RX_ADC_I_Q_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_ADC_RESET_EN_RX_HI:8;
      uint64_t RX_ADC_RESET_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_BBA_I_Q_EN_RX_HI:8;
      uint64_t RX_BBA_I_Q_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_BBA_PDET_EN_RX_HI:8;
      uint64_t RX_BBA_PDET_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_BBA_TZA_DCOC_EN_RX_HI:8;
      uint64_t RX_BBA_TZA_DCOC_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_TZA_I_Q_EN_RX_HI:8;
      uint64_t RX_TZA_I_Q_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_TZA_PDET_EN_RX_HI:8;
      uint64_t RX_TZA_PDET_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_DIG_EN_TX_HI:8;
      uint64_t PLL_DIG_EN_TX_LO:8;
      uint64_t PLL_DIG_EN_RX_HI:8;
      uint64_t PLL_DIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_DIG_EN_TX_HI:8;
      uint64_t TX_DIG_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_DIG_EN_RX_HI:8;
      uint64_t RX_DIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_INIT_RX_HI:8;
      uint64_t RX_INIT_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA_DELTA_EN_TX_HI:8;
      uint64_t SIGMA_DELTA_EN_TX_LO:8;
      uint64_t SIGMA_DELTA_EN_RX_HI:8;
      uint64_t SIGMA_DELTA_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RX_PHY_EN_RX_HI:8;
      uint64_t RX_PHY_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DCOC_EN_RX_HI:8;
      uint64_t DCOC_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DCOC_INIT_RX_HI:8;
      uint64_t DCOC_INIT_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR_ADC_TRIG_EN_TX_HI:8;
      uint64_t SAR_ADC_TRIG_EN_TX_LO:8;
      uint64_t SAR_ADC_TRIG_EN_RX_HI:8;
      uint64_t SAR_ADC_TRIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_SPARE0_EN_TX_HI:8;
      uint64_t TSM_SPARE0_EN_TX_LO:8;
      uint64_t TSM_SPARE0_EN_RX_HI:8;
      uint64_t TSM_SPARE0_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_SPARE1_EN_TX_HI:8;
      uint64_t TSM_SPARE1_EN_TX_LO:8;
      uint64_t TSM_SPARE1_EN_RX_HI:8;
      uint64_t TSM_SPARE1_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_SPARE2_EN_TX_HI:8;
      uint64_t TSM_SPARE2_EN_TX_LO:8;
      uint64_t TSM_SPARE2_EN_RX_HI:8;
      uint64_t TSM_SPARE2_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_SPARE3_EN_TX_HI:8;
      uint64_t TSM_SPARE3_EN_TX_LO:8;
      uint64_t TSM_SPARE3_EN_RX_HI:8;
      uint64_t TSM_SPARE3_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0_TRIG_EN_TX_HI:8;
      uint64_t GPIO0_TRIG_EN_TX_LO:8;
      uint64_t GPIO0_TRIG_EN_RX_HI:8;
      uint64_t GPIO0_TRIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO1_TRIG_EN_TX_HI:8;
      uint64_t GPIO1_TRIG_EN_TX_LO:8;
      uint64_t GPIO1_TRIG_EN_RX_HI:8;
      uint64_t GPIO1_TRIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO2_TRIG_EN_TX_HI:8;
      uint64_t GPIO2_TRIG_EN_TX_LO:8;
      uint64_t GPIO2_TRIG_EN_RX_HI:8;
      uint64_t GPIO2_TRIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO3_TRIG_EN_TX_HI:8;
      uint64_t GPIO3_TRIG_EN_TX_LO:8;
      uint64_t GPIO3_TRIG_EN_RX_HI:8;
      uint64_t GPIO3_TRIG_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_BIAS_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_BIAS_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_FCAL_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_FCAL_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_LF_PD_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_LF_PD_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_ADC_BUF_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_ADC_BUF_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_AUXPLL_DIG_BUF_EN_RX_HI:8;
      uint64_t RXTX_AUXPLL_DIG_BUF_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RXTX_RCCAL_EN_RX_HI:8;
      uint64_t RXTX_RCCAL_EN_RX_LO:8;
    } __attribute__((packed)) B;
  } TIMING57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HPM_DAC_EN_TX_HI:8;
      uint64_t TX_HPM_DAC_EN_TX_LO:8;
    } __attribute__((packed)) B;
  } TIMING58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_HF_EN_OVRD_EN:1;
      uint64_t BB_LDO_HF_EN_OVRD:1;
      uint64_t BB_LDO_ADCDAC_EN_OVRD_EN:1;
      uint64_t BB_LDO_ADCDAC_EN_OVRD:1;
      uint64_t BB_LDO_BBA_EN_OVRD_EN:1;
      uint64_t BB_LDO_BBA_EN_OVRD:1;
      uint64_t BB_LDO_PD_EN_OVRD_EN:1;
      uint64_t BB_LDO_PD_EN_OVRD:1;
      uint64_t BB_LDO_FDBK_EN_OVRD_EN:1;
      uint64_t BB_LDO_FDBK_EN_OVRD:1;
      uint64_t BB_LDO_VCOLO_EN_OVRD_EN:1;
      uint64_t BB_LDO_VCOLO_EN_OVRD:1;
      uint64_t BB_LDO_VTREF_EN_OVRD_EN:1;
      uint64_t BB_LDO_VTREF_EN_OVRD:1;
      uint64_t BB_LDO_FDBK_BLEED_EN_OVRD_EN:1;
      uint64_t BB_LDO_FDBK_BLEED_EN_OVRD:1;
      uint64_t BB_LDO_VCOLO_BLEED_EN_OVRD_EN:1;
      uint64_t BB_LDO_VCOLO_BLEED_EN_OVRD:1;
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_OVRD_EN:1;
      uint64_t BB_LDO_VCOLO_FASTCHARGE_EN_OVRD:1;
      uint64_t BB_XTAL_PLL_REF_CLK_EN_OVRD_EN:1;
      uint64_t BB_XTAL_PLL_REF_CLK_EN_OVRD:1;
      uint64_t BB_XTAL_DAC_REF_CLK_EN_OVRD_EN:1;
      uint64_t BB_XTAL_DAC_REF_CLK_EN_OVRD:1;
      uint64_t BB_XTAL_AUXPLL_REF_CLK_EN_OVRD_EN:1;
      uint64_t BB_XTAL_AUXPLL_REF_CLK_EN_OVRD:1;
      uint64_t PLL_LOOP_IS_OPEN_OVRD_EN:1;
      uint64_t PLL_LOOP_IS_OPEN_OVRD:1;
      uint64_t SY_PD_CYCLE_SLIP_LD_EN_OVRD_EN:1;
      uint64_t SY_PD_CYCLE_SLIP_LD_EN_OVRD:1;
      uint64_t SY_VCO_EN_OVRD_EN:1;
      uint64_t SY_VCO_EN_OVRD:1;
    } __attribute__((packed)) B;
  } OVRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_LO_RX_BUF_EN_OVRD_EN:1;
      uint64_t SY_LO_RX_BUF_EN_OVRD:1;
      uint64_t SY_LO_TX_BUF_EN_OVRD_EN:1;
      uint64_t SY_LO_TX_BUF_EN_OVRD:1;
      uint64_t SY_DIVN_EN_OVRD_EN:1;
      uint64_t SY_DIVN_EN_OVRD:1;
      uint64_t SY_PD_FILTER_CHARGE_EN_OVRD_EN:1;
      uint64_t SY_PD_FILTER_CHARGE_EN_OVRD:1;
      uint64_t SY_PD_EN_OVRD_EN:1;
      uint64_t SY_PD_EN_OVRD:1;
      uint64_t SY_LO_DIVN_EN_OVRD_EN:1;
      uint64_t SY_LO_DIVN_EN_OVRD:1;
      uint64_t SY_LO_RX_EN_OVRD_EN:1;
      uint64_t SY_LO_RX_EN_OVRD:1;
      uint64_t SY_LO_TX_EN_OVRD_EN:1;
      uint64_t SY_LO_TX_EN_OVRD:1;
      uint64_t SY_DIVN_CAL_EN_OVRD_EN:1;
      uint64_t SY_DIVN_CAL_EN_OVRD:1;
      uint64_t RX_MIXER_EN_OVRD_EN:1;
      uint64_t RX_MIXER_EN_OVRD:1;
      uint64_t TX_PA_EN_OVRD_EN:1;
      uint64_t TX_PA_EN_OVRD:1;
      uint64_t RX_ADC_I_EN_OVRD_EN:1;
      uint64_t RX_ADC_I_EN_OVRD:1;
      uint64_t RX_ADC_Q_EN_OVRD_EN:1;
      uint64_t RX_ADC_Q_EN_OVRD:1;
      uint64_t RX_ADC_RESET_EN_OVRD_EN:1;
      uint64_t RX_ADC_RESET_EN_OVRD:1;
      uint64_t RX_BBA_I_EN_OVRD_EN:1;
      uint64_t RX_BBA_I_EN_OVRD:1;
      uint64_t RX_BBA_Q_EN_OVRD_EN:1;
      uint64_t RX_BBA_Q_EN_OVRD:1;
    } __attribute__((packed)) B;
  } OVRD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BBA_PDET_EN_OVRD_EN:1;
      uint64_t RX_BBA_PDET_EN_OVRD:1;
      uint64_t RX_BBA_DCOC_EN_OVRD_EN:1;
      uint64_t RX_BBA_DCOC_EN_OVRD:1;
      uint64_t RX_LNA_EN_OVRD_EN:1;
      uint64_t RX_LNA_EN_OVRD:1;
      uint64_t RX_TZA_I_EN_OVRD_EN:1;
      uint64_t RX_TZA_I_EN_OVRD:1;
      uint64_t RX_TZA_Q_EN_OVRD_EN:1;
      uint64_t RX_TZA_Q_EN_OVRD:1;
      uint64_t RX_TZA_PDET_EN_OVRD_EN:1;
      uint64_t RX_TZA_PDET_EN_OVRD:1;
      uint64_t RX_TZA_DCOC_EN_OVRD_EN:1;
      uint64_t RX_TZA_DCOC_EN_OVRD:1;
      uint64_t PLL_DIG_EN_OVRD_EN:1;
      uint64_t PLL_DIG_EN_OVRD:1;
      uint64_t TX_DIG_EN_OVRD_EN:1;
      uint64_t TX_DIG_EN_OVRD:1;
      uint64_t RX_DIG_EN_OVRD_EN:1;
      uint64_t RX_DIG_EN_OVRD:1;
      uint64_t RX_INIT_OVRD_EN:1;
      uint64_t RX_INIT_OVRD:1;
      uint64_t SIGMA_DELTA_EN_OVRD_EN:1;
      uint64_t SIGMA_DELTA_EN_OVRD:1;
      uint64_t RX_PHY_EN_OVRD_EN:1;
      uint64_t RX_PHY_EN_OVRD:1;
      uint64_t DCOC_EN_OVRD_EN:1;
      uint64_t DCOC_EN_OVRD:1;
      uint64_t DCOC_INIT_OVRD_EN:1;
      uint64_t DCOC_INIT_OVRD:1;
      uint64_t FREQ_TARG_LD_EN_OVRD_EN:1;
      uint64_t FREQ_TARG_LD_EN_OVRD:1;
    } __attribute__((packed)) B;
  } OVRD2;

