iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSM_SPARE0_EN_OVRD_EN:1;
      uint64_t TSM_SPARE0_EN_OVRD:1;
      uint64_t TSM_SPARE1_EN_OVRD_EN:1;
      uint64_t TSM_SPARE1_EN_OVRD:1;
      uint64_t TSM_SPARE2_EN_OVRD_EN:1;
      uint64_t TSM_SPARE2_EN_OVRD:1;
      uint64_t TSM_SPARE3_EN_OVRD_EN:1;
      uint64_t TSM_SPARE3_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_BIAS_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_BIAS_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_VCO_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_VCO_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_FCAL_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_FCAL_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_LF_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_LF_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_PD_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_PD_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_ADC_BUF_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_ADC_BUF_EN_OVRD:1;
      uint64_t RXTX_AUXPLL_DIG_BUF_EN_OVRD_EN:1;
      uint64_t RXTX_AUXPLL_DIG_BUF_EN_OVRD:1;
      uint64_t RXTX_RCCAL_EN_OVRD_EN:1;
      uint64_t RXTX_RCCAL_EN_OVRD:1;
      uint64_t TX_HPM_DAC_EN_OVRD_EN:1;
      uint64_t TX_HPM_DAC_EN_OVRD:1;
      uint64_t TX_MODE_OVRD_EN:1;
      uint64_t TX_MODE_OVRD:1;
      uint64_t RX_MODE_OVRD_EN:1;
      uint64_t RX_MODE_OVRD:1;
    } __attribute__((packed)) B;
  } OVRD3;

} __attribute__((packed));

#define XCVR_TSM (*(volatile struct XCVR_TSM_tag *) 0x4005c2c0)

struct XCVR_PHY_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSK_PREAMBLE_REF0:32;
    } __attribute__((packed)) B;
  } PRE_REF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSK_PREAMBLE_REF1:32;
    } __attribute__((packed)) B;
  } PRE_REF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSK_PREAMBLE_REF2:16;
    } __attribute__((packed)) B;
  } PRE_REF2;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AA_PLAYBACK:1;
      uint64_t AA_OUTPUT_SEL:1;
      uint64_t FSK_BIT_INVERT:1;
      uint64_t RFU00:1;
      uint64_t BSM_EN_BLE:1;
      uint64_t DEMOD_CLK_MODE:2;
      uint64_t CTS_THRESH:8;
      uint64_t reservedSpace1:4;
      uint64_t FSK_FTS_TIMEOUT:3;
      uint64_t reservedSpace2:1;
      uint64_t RFU01:1;
      uint64_t RFU02:1;
      uint64_t reservedSpace3:2;
      uint64_t BLE_NTW_ADR_THR:3;
    } __attribute__((packed)) B;
  } CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FIFO_PRECHG:4;
      uint64_t RFU03:1;
      uint64_t RFU04:1;
      uint64_t RFU05:1;
      uint64_t RFU06:1;
      uint64_t X2_DEMOD_GAIN:4;
      uint64_t reservedSpace0:4;
      uint64_t RFU07:1;
      uint64_t RFU08:1;
      uint64_t RFU09:1;
      uint64_t RFU10:1;
      uint64_t RFU11:1;
      uint64_t RFU12:1;
      uint64_t RFU13:1;
      uint64_t RFU14:1;
      uint64_t RFU15:1;
      uint64_t RFU16:1;
      uint64_t reservedSpace1:5;
      uint64_t PHY_CLK_ON:1;
    } __attribute__((packed)) B;
  } CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EL_ENABLE:1;
      uint64_t reservedSpace0:7;
      uint64_t EL_WIN_SIZE:4;
      uint64_t reservedSpace1:4;
      uint64_t EL_INTERVAL:6;
    } __attribute__((packed)) B;
  } EL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_BSM:32;
    } __attribute__((packed)) B;
  } NTW_ADR_BSM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE_FOUND:1;
      uint64_t AA_SFD_MATCHED:1;
      uint64_t reservedSpace0:2;
      uint64_t AA_MATCHED:4;
      uint64_t HAMMING_DISTANCE:3;
      uint64_t reservedSpace1:1;
      uint64_t DATA_FIFO_DEPTH:4;
      uint64_t CFO_ESTIMATE:8;
    } __attribute__((packed)) B;
  } STATUS;

} __attribute__((packed));

#define XCVR_PHY (*(volatile struct XCVR_PHY_tag *) 0x4005c400)

struct XCVR_ANALOG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_ADCDAC_BYP:1;
      uint64_t BB_LDO_ADCDAC_DIAGSEL:1;
      uint64_t BB_LDO_ADCDAC_SPARE:2;
      uint64_t BB_LDO_ADCDAC_TRIM:3;
      uint64_t reservedSpace0:1;
      uint64_t BB_LDO_BBA_BYP:1;
      uint64_t BB_LDO_BBA_DIAGSEL:1;
      uint64_t BB_LDO_BBA_SPARE:2;
      uint64_t BB_LDO_BBA_TRIM:3;
      uint64_t reservedSpace1:1;
      uint64_t BB_LDO_FDBK_BYP:1;
      uint64_t BB_LDO_FDBK_DIAGSEL:1;
      uint64_t BB_LDO_FDBK_SPARE:2;
      uint64_t BB_LDO_FDBK_TRIM:3;
      uint64_t reservedSpace2:1;
      uint64_t BB_LDO_HF_BYP:1;
      uint64_t BB_LDO_HF_DIAGSEL:1;
      uint64_t BB_LDO_HF_SPARE:2;
      uint64_t BB_LDO_HF_TRIM:3;
    } __attribute__((packed)) B;
  } BB_LDO_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BB_LDO_PD_BYP:1;
      uint64_t BB_LDO_PD_DIAGSEL:1;
      uint64_t BB_LDO_PD_SPARE:2;
      uint64_t BB_LDO_PD_TRIM:3;
      uint64_t reservedSpace0:1;
      uint64_t BB_LDO_VCO_SPARE:2;
      uint64_t BB_LDO_VCOLO_BYP:1;
      uint64_t BB_LDO_VCOLO_DIAGSEL:1;
      uint64_t BB_LDO_VCOLO_TRIM:3;
      uint64_t reservedSpace1:1;
      uint64_t BB_LDO_VTREF_DIAGSEL:1;
      uint64_t BB_LDO_VTREF_TC:2;
    } __attribute__((packed)) B;
  } BB_LDO_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ADC_BUMP:8;
      uint64_t RX_ADC_FS_SEL:2;
      uint64_t RX_ADC_I_DIAGSEL:1;
      uint64_t RX_ADC_Q_DIAGSEL:1;
      uint64_t RX_ADC_SPARE:4;
    } __attribute__((packed)) B;
  } RX_ADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BBA_BW_SEL:3;
      uint64_t RX_BBA_CUR_BUMP:1;
      uint64_t RX_BBA_DIAGSEL1:1;
      uint64_t RX_BBA_DIAGSEL2:1;
      uint64_t RX_BBA_DIAGSEL3:1;
      uint64_t RX_BBA_DIAGSEL4:1;
      uint64_t reservedSpace0:8;
      uint64_t RX_BBA_SPARE:6;
      uint64_t reservedSpace1:2;
      uint64_t RX_BBA2_BW_SEL:3;
      uint64_t reservedSpace2:1;
      uint64_t RX_BBA2_SPARE:3;
    } __attribute__((packed)) B;
  } RX_BBA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_LNA_BUMP:4;
      uint64_t RX_LNA_HG_DIAGSEL:1;
      uint64_t RX_LNA_HIZ_ENABLE:1;
      uint64_t RX_LNA_LG_DIAGSEL:1;
      uint64_t reservedSpace0:1;
      uint64_t RX_LNA_SPARE:2;
      uint64_t reservedSpace1:6;
      uint64_t RX_MIXER_BUMP:4;
      uint64_t RX_MIXER_SPARE:1;
    } __attribute__((packed)) B;
  } RX_LNA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TZA_BW_SEL:3;
      uint64_t RX_TZA_CUR_BUMP:1;
      uint64_t RX_TZA_GAIN_BUMP:1;
      uint64_t reservedSpace0:11;
      uint64_t RX_TZA_SPARE:6;
      uint64_t reservedSpace1:2;
      uint64_t RX_TZA1_DIAGSEL:1;
      uint64_t RX_TZA2_DIAGSEL:1;
      uint64_t RX_TZA3_DIAGSEL:1;
      uint64_t RX_TZA4_DIAGSEL:1;
    } __attribute__((packed)) B;
  } RX_TZA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIAS_TRIM:3;
      uint64_t DIAGSEL1:1;
      uint64_t DIAGSEL2:1;
      uint64_t LF_CNTL:3;
      uint64_t SPARE:4;
      uint64_t VCO_DAC_REF_ADJUST:4;
      uint64_t VTUNE_TESTMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t RXTX_BAL_BIAST:2;
      uint64_t reservedSpace1:2;
      uint64_t RXTX_BAL_SPARE:3;
      uint64_t reservedSpace2:1;
      uint64_t RXTX_RCCAL_DIAGSEL:1;
    } __attribute__((packed)) B;
  } RX_AUXPLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_DIVN_SPARE:1;
      uint64_t SY_FCAL_SPARE:1;
      uint64_t reservedSpace0:2;
      uint64_t SY_LO_BUMP_RTLO_FDBK:2;
      uint64_t SY_LO_BUMP_RTLO_RX:2;
      uint64_t SY_LO_BUMP_RTLO_TX:2;
      uint64_t SY_LO_DIAGSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SY_LO_SPARE:3;
      uint64_t reservedSpace2:1;
      uint64_t SY_LPF_FILT_CTRL:3;
      uint64_t SY_LPF_SPARE:1;
      uint64_t SY_PD_DIAGSEL:1;
      uint64_t SY_PD_PCH_TUNE:2;
      uint64_t SY_PD_PCH_SEL:1;
      uint64_t SY_PD_SPARE:2;
      uint64_t reservedSpace3:2;
      uint64_t SY_PD_VTUNE_OVERRIDE_TEST_MODE:1;
    } __attribute__((packed)) B;
  } SY_CTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SY_VCO_BIAS:3;
      uint64_t SY_VCO_DIAGSEL:1;
      uint64_t SY_VCO_KV:3;
      uint64_t reservedSpace0:1;
      uint64_t SY_VCO_KVM:3;
      uint64_t reservedSpace1:1;
      uint64_t SY_VCO_PK_DET_ON:1;
      uint64_t reservedSpace2:1;
      uint64_t SY_VCO_SPARE:3;
    } __attribute__((packed)) B;
  } SY_CTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_DAC_BUMP_CAP:2;
      uint64_t reservedSpace0:1;
      uint64_t TX_DAC_BUMP_IDAC:2;
      uint64_t reservedSpace1:1;
      uint64_t TX_DAC_BUMP_RLOAD:2;
      uint64_t reservedSpace2:1;
      uint64_t TX_DAC_DIAGSEL:1;
      uint64_t TX_DAC_INVERT_CLK:1;
      uint64_t TX_DAC_OPAMP_DIAGSEL:1;
      uint64_t reservedSpace3:1;
      uint64_t TX_DAC_SPARE:3;
      uint64_t reservedSpace4:1;
      uint64_t TX_PA_BUMP_VBIAS:3;
      uint64_t reservedSpace5:1;
      uint64_t TX_PA_DIAGSEL:1;
      uint64_t reservedSpace6:1;
      uint64_t TX_PA_SPARE:3;
    } __attribute__((packed)) B;
  } TX_DAC_PA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTX_BAL_TX_CODE:24;
    } __attribute__((packed)) B;
  } BALUN_TX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTX_BAL_RX_CODE:24;
    } __attribute__((packed)) B;
  } BALUN_RX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_FREQ_COUNTER:19;
      uint64_t reservedSpace0:1;
      uint64_t CTUNE_MAX_DIFF:12;
    } __attribute__((packed)) B;
  } DFT_OBSV_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN_BIST_MAX_DIFF:17;
      uint64_t reservedSpace0:7;
      uint64_t SYN_BIST_MAX_DIFF_CH:7;
      uint64_t SYN_BIST_IGNORE_FAILS:1;
    } __attribute__((packed)) B;
  } DFT_OBSV_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPM_BIST_INCREMENT:3;
      uint64_t reservedSpace0:5;
      uint64_t HPM_BIST_STOP:8;
      uint64_t HPM_BIST_START:8;
    } __attribute__((packed)) B;
  } DFT_OBSV_3;

} __attribute__((packed));

