iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
#define XCVR_ANALOG (*(volatile struct XCVR_ANALOG_tag *) 0x4005c500)

struct XCVR_PKT_RAM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_47;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_48;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_49;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_50;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_51;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_52;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_53;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_54;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_55;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_56;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_57;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_58;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_59;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_60;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_61;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_62;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_63;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_64;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_65;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_66;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_67;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_68;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_69;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_70;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_71;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_72;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_73;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_74;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_75;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_76;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_77;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_78;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_79;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_80;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_81;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_82;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_83;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_84;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_85;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_86;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_87;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_88;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_89;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_90;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_91;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_92;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_93;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_94;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_95;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_96;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_97;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_98;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_99;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_100;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_101;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_102;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_103;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_104;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_105;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_106;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_107;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_108;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_109;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_110;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_111;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_112;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_113;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_114;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_115;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_116;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_117;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_118;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_119;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_120;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_121;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_122;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_123;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_124;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_125;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_126;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_127;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_128;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_129;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_130;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_131;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_132;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_133;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_134;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_135;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_136;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_137;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_138;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_139;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_140;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_141;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_142;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_143;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_144;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_145;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_146;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_147;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_148;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_149;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_150;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_151;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_152;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_153;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_154;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_155;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_156;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_157;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_158;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_159;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_160;

