iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_483;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_484;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_485;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_486;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_487;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_488;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_489;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_490;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_491;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_492;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_493;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_494;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_495;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_496;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_497;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_498;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_499;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_500;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_501;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_502;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_503;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_504;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_505;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_506;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_507;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_508;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_509;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_510;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_511;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_512;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_513;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_514;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_515;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_516;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_517;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_518;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_519;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_520;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_521;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_522;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_523;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_524;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_525;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_526;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_527;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_528;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_529;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_530;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_531;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_532;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_533;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_534;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_535;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_536;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_537;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_538;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_539;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_540;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_541;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_542;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_543;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_544;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_545;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_546;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_547;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_548;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_549;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_550;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_551;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_552;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_553;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_554;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_555;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_556;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_557;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_558;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_559;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_560;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_561;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_562;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_563;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_564;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_565;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_566;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_567;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_568;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_569;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_570;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_571;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_572;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_573;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_574;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_575;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_576;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_577;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_578;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_579;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_580;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_581;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_582;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_583;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_584;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_585;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_586;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_587;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_588;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_589;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_590;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_591;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_592;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_593;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_594;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_595;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_596;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_597;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_598;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_599;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_600;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_601;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_602;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_603;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_604;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_605;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_606;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_607;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_608;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_609;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_610;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_611;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_612;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_613;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_614;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_615;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_616;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_617;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_618;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_619;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_620;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_621;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_622;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_623;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_624;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_625;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_626;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_627;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_628;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_629;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_630;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_631;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_632;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_633;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_634;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_635;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_636;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_637;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_638;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_639;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_640;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_641;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_642;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_643;

