iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_805;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_806;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_807;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_808;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_809;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_810;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_811;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_812;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_813;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_814;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_815;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_816;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_817;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_818;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_819;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_820;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_821;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_822;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_823;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_824;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_825;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_826;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_827;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_828;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_829;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_830;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_831;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_832;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_833;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_834;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_835;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_836;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_837;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_838;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_839;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_840;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_841;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_842;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_843;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_844;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_845;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_846;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_847;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_848;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_849;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_850;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_851;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_852;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_853;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_854;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_855;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_856;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_857;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_858;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_859;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_860;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_861;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_862;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_863;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_864;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_865;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_866;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_867;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_868;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_869;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_870;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_871;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_872;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_873;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_874;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_875;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_876;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_877;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_878;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_879;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_880;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_881;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_882;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_883;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_884;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_885;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_886;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_887;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_888;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_889;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_890;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_891;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_892;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_893;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_894;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_895;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_896;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_897;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_898;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_899;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_900;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_901;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_902;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_903;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_904;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_905;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_906;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_907;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_908;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_909;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_910;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_911;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_912;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_913;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_914;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_915;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_916;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_917;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_918;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_919;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_920;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_921;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_922;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_923;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_924;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_925;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_926;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_927;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_928;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_929;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_930;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_931;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_932;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_933;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_934;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_935;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_936;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_937;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_938;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_939;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_940;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_941;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_942;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_943;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_944;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_945;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_946;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_947;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_948;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_949;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_950;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_951;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_952;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_953;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_954;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_955;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_956;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_957;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_958;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_959;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_960;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_961;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_962;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_963;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_964;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_965;

