iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1126;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1127;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1128;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1129;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1130;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1131;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1132;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1133;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1134;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1135;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1136;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1137;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1138;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1139;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1140;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1141;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1142;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1143;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1144;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1145;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1146;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1147;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1148;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1149;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1150;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LSBYTE:8;
      uint64_t MSBYTE:8;
    } __attribute__((packed)) B;
  } PACKET_RAM_1151;

} __attribute__((packed));

#define XCVR_PKT_RAM (*(volatile struct XCVR_PKT_RAM_tag *) 0x4005c700)

struct GENFSK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQ_END_IRQ:1;
      uint64_t TX_IRQ:1;
      uint64_t RX_IRQ:1;
      uint64_t NTW_ADR_IRQ:1;
      uint64_t T1_IRQ:1;
      uint64_t T2_IRQ:1;
      uint64_t PLL_UNLOCK_IRQ:1;
      uint64_t WAKE_IRQ:1;
      uint64_t RX_WATERMARK_IRQ:1;
      uint64_t TSM_IRQ:1;
      uint64_t reservedSpace0:6;
      uint64_t SEQ_END_IRQ_EN:1;
      uint64_t TX_IRQ_EN:1;
      uint64_t RX_IRQ_EN:1;
      uint64_t NTW_ADR_IRQ_EN:1;
      uint64_t T1_IRQ_EN:1;
      uint64_t T2_IRQ_EN:1;
      uint64_t PLL_UNLOCK_IRQ_EN:1;
      uint64_t WAKE_IRQ_EN:1;
      uint64_t RX_WATERMARK_IRQ_EN:1;
      uint64_t TSM_IRQ_EN:1;
      uint64_t GENERIC_FSK_IRQ_EN:1;
      uint64_t CRC_IGNORE:1;
      uint64_t reservedSpace1:3;
      uint64_t CRC_VALID:1;
    } __attribute__((packed)) B;
  } IRQ_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVENT_TMR:24;
      uint64_t EVENT_TMR_LD:1;
      uint64_t EVENT_TMR_ADD:1;
    } __attribute__((packed)) B;
  } EVENT_TMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T1_CMP:24;
      uint64_t T1_CMP_EN:1;
    } __attribute__((packed)) B;
  } T1_CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2_CMP:24;
      uint64_t T2_CMP_EN:1;
    } __attribute__((packed)) B;
  } T2_CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMESTAMP:24;
    } __attribute__((packed)) B;
  } TIMESTAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQCMD:4;
      uint64_t reservedSpace0:4;
      uint64_t LENGTH_EXT:11;
      uint64_t reservedSpace1:5;
      uint64_t CMDDEC_CS:3;
      uint64_t reservedSpace2:4;
      uint64_t XCVR_BUSY:1;
    } __attribute__((packed)) B;
  } XCVR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_START_T1_PEND:1;
      uint64_t TX_START_T2_PEND:1;
      uint64_t TX_IN_WARMUP:1;
      uint64_t TX_IN_PROGRESS:1;
      uint64_t TX_IN_WARMDN:1;
      uint64_t RX_START_T1_PEND:1;
      uint64_t RX_START_T2_PEND:1;
      uint64_t RX_STOP_T1_PEND:1;
      uint64_t RX_STOP_T2_PEND:1;
      uint64_t RX_IN_WARMUP:1;
      uint64_t RX_IN_SEARCH:1;
      uint64_t RX_IN_PROGRESS:1;
      uint64_t RX_IN_WARMDN:1;
      uint64_t reservedSpace0:1;
      uint64_t LQI_VALID:1;
      uint64_t CRC_VALID:1;
      uint64_t RSSI:8;
      uint64_t LQI:8;
    } __attribute__((packed)) B;
  } XCVR_STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_WHITEN_DIS:1;
      uint64_t RX_DEWHITEN_DIS:1;
      uint64_t SW_CRC_EN:1;
      uint64_t STOP_POSTPONE_ON_AA:1;
      uint64_t PREAMBLE_SZ:3;
      uint64_t reservedSpace0:1;
      uint64_t TX_WARMUP:8;
      uint64_t RX_WARMUP:8;
    } __attribute__((packed)) B;
  } XCVR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_NUM:7;
    } __attribute__((packed)) B;
  } CHANNEL_NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_POWER:6;
    } __attribute__((packed)) B;
  } TX_POWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_EN:4;
      uint64_t NTW_ADR_MCH:4;
      uint64_t NTW_ADR0_SZ:2;
      uint64_t NTW_ADR1_SZ:2;
      uint64_t NTW_ADR2_SZ:2;
      uint64_t NTW_ADR3_SZ:2;
      uint64_t NTW_ADR_THR0:3;
      uint64_t reservedSpace0:1;
      uint64_t NTW_ADR_THR1:3;
      uint64_t reservedSpace1:1;
      uint64_t NTW_ADR_THR2:3;
      uint64_t reservedSpace2:1;
      uint64_t NTW_ADR_THR3:3;
    } __attribute__((packed)) B;
  } NTW_ADR_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_0:32;
    } __attribute__((packed)) B;
  } NTW_ADR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_1:32;
    } __attribute__((packed)) B;
  } NTW_ADR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_2:32;
    } __attribute__((packed)) B;
  } NTW_ADR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTW_ADR_3:32;
    } __attribute__((packed)) B;
  } NTW_ADR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_WATERMARK:13;
      uint64_t reservedSpace0:3;
      uint64_t BYTE_COUNTER:13;
    } __attribute__((packed)) B;
  } RX_WATERMARK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN_SLEEP_REQUEST:1;
    } __attribute__((packed)) B;
  } DSM_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_ID:8;
    } __attribute__((packed)) B;
  } PART_ID;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTH_SZ:5;
      uint64_t LENGTH_BIT_ORD:1;
      uint64_t SYNC_ADDR_SZ:2;
      uint64_t LENGTH_ADJ:8;
      uint64_t H0_SZ:5;
      uint64_t LENGTH_ADJ_UNSIGNED:1;
      uint64_t reservedSpace0:2;
      uint64_t H1_SZ:5;
      uint64_t H1_FAIL:1;
      uint64_t H0_FAIL:1;
      uint64_t LENGTH_FAIL:1;
    } __attribute__((packed)) B;
  } PACKET_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0_MATCH:16;
      uint64_t H0_MASK:16;
    } __attribute__((packed)) B;
  } H0_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H1_MATCH:16;
      uint64_t H1_MASK:16;
    } __attribute__((packed)) B;
  } H1_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SZ:3;
      uint64_t reservedSpace0:5;
      uint64_t CRC_START_BYTE:4;
      uint64_t reservedSpace1:4;
      uint64_t CRC_REF_IN:1;
      uint64_t CRC_REF_OUT:1;
      uint64_t CRC_BYTE_ORD:1;
    } __attribute__((packed)) B;
  } CRC_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEED:32;
    } __attribute__((packed)) B;
  } CRC_INIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_POLY:32;
    } __attribute__((packed)) B;
  } CRC_POLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_XOR_OUT:32;
    } __attribute__((packed)) B;
  } CRC_XOR_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHITEN_START:2;
      uint64_t WHITEN_END:1;
      uint64_t WHITEN_B4_CRC:1;
      uint64_t WHITEN_POLY_TYPE:1;
      uint64_t WHITEN_REF_IN:1;
      uint64_t WHITEN_PAYLOAD_REINIT:1;
      uint64_t reservedSpace0:1;
      uint64_t WHITEN_SIZE:4;
      uint64_t MANCHESTER_EN:1;
      uint64_t MANCHESTER_INV:1;
      uint64_t MANCHESTER_START:1;
      uint64_t reservedSpace1:1;
      uint64_t WHITEN_INIT:9;
    } __attribute__((packed)) B;
  } WHITEN_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHITEN_POLY:9;
    } __attribute__((packed)) B;
  } WHITEN_POLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WHITEN_SZ_THR:12;
      uint64_t reservedSpace0:4;
      uint64_t LENGTH_MAX:7;
      uint64_t REC_BAD_PKT:1;
    } __attribute__((packed)) B;
  } WHITEN_SZ_THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITRATE:2;
    } __attribute__((packed)) B;
  } BITRATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PB_PARTITION:11;
    } __attribute__((packed)) B;
  } PB_PARTITION;

  uint8_t res1[1648];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_47;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_48;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_49;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_50;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_51;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_52;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_53;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_54;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_55;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_56;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_57;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_58;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_59;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_60;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_61;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_62;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_63;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_64;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_65;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_66;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_67;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_68;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_69;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_70;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_71;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_72;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_73;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_74;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_75;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_76;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_77;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_78;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_79;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_80;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_81;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_82;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_83;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_84;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_85;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_86;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_87;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_88;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_89;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_90;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_91;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_92;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_93;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_94;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_95;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_96;

