iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_274;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_275;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_276;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_277;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_278;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_279;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_280;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_281;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_282;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_283;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_284;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_285;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_286;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_287;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_288;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_289;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_290;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_291;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_292;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_293;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_294;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_295;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_296;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_297;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_298;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_299;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_300;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_301;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_302;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_303;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_304;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_305;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_306;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_307;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_308;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_309;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_310;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_311;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_312;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_313;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_314;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_315;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_316;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_317;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_318;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_319;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_320;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_321;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_322;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_323;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_324;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_325;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_326;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_327;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_328;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_329;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_330;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_331;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_332;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_333;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_334;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_335;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_336;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_337;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_338;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_339;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_340;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_341;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_342;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_343;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_344;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_345;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_346;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_347;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_348;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_349;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_350;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_351;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_352;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_353;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_354;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_355;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_356;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_357;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_358;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_359;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_360;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_361;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_362;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_363;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_364;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_365;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_366;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_367;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_368;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_369;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_370;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_371;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_372;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_373;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_374;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_375;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_376;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_377;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_378;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_379;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_380;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_381;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_382;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_383;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_384;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_385;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_386;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_387;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_388;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_389;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_390;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_391;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_392;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_393;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_394;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_395;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_396;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_397;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_398;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_399;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_400;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_401;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_402;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_403;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_404;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_405;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_406;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_407;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_408;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_409;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_410;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_411;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_412;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_413;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_414;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_415;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_416;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_417;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_418;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_419;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_420;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_421;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_422;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_423;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_424;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_425;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_426;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_427;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_428;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_429;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_430;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_431;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_432;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_433;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_434;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_435;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_436;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_437;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_438;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_439;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_440;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_441;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_442;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_443;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_444;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_445;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_446;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_447;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_448;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_449;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_450;

