iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_451;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_452;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_453;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_454;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_455;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_456;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_457;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_458;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_459;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_460;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_461;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_462;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_463;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_464;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_465;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_466;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_467;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_468;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_469;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_470;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_471;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_472;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_473;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_474;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_475;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_476;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_477;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_478;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_479;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_480;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_481;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_482;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_483;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_484;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_485;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_486;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_487;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_488;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_489;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_490;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_491;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_492;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_493;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_494;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_495;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_496;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_497;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_498;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_499;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_500;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_501;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_502;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_503;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_504;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_505;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_506;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_507;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_508;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_509;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_510;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_511;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_512;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_513;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_514;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_515;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_516;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_517;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_518;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_519;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_520;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_521;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_522;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_523;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_524;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_525;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_526;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_527;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_528;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_529;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_530;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_531;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_532;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_533;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_534;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_535;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_536;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_537;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_538;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_539;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_540;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_541;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_542;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_543;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_544;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_545;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_546;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_547;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_548;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_549;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_550;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_551;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_552;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_553;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_554;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_555;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_556;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_557;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_558;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_559;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_560;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_561;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_562;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_563;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_564;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_565;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_566;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_567;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_568;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_569;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_570;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_571;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_572;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_573;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_574;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_575;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_576;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_577;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_578;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_579;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_580;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_581;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_582;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_583;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_584;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_585;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_586;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_587;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_588;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_589;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_590;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_591;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_592;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_593;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_594;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_595;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_596;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_597;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_598;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_599;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_600;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_601;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_602;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_603;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_604;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_605;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_606;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_607;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_608;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_609;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_610;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_611;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_612;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_613;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_614;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_615;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_616;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_617;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_618;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_619;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_620;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_621;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_622;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_623;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_624;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_625;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_626;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_627;

