iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_628;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_629;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_630;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_631;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_632;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_633;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_634;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_635;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_636;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_637;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_638;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_639;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_640;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_641;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_642;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_643;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_644;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_645;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_646;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_647;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_648;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_649;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_650;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_651;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_652;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_653;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_654;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_655;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_656;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_657;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_658;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_659;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_660;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_661;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_662;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_663;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_664;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_665;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_666;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_667;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_668;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_669;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_670;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_671;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_672;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_673;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_674;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_675;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_676;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_677;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_678;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_679;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_680;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_681;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_682;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_683;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_684;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_685;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_686;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_687;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_688;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_689;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_690;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_691;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_692;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_693;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_694;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_695;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_696;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_697;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_698;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_699;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_700;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_701;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_702;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_703;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_704;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_705;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_706;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_707;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_708;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_709;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_710;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_711;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_712;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_713;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_714;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_715;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_716;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_717;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_718;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_719;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_720;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_721;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_722;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_723;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_724;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_725;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_726;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_727;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_728;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_729;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_730;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_731;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_732;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_733;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_734;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_735;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_736;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_737;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_738;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_739;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_740;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_741;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_742;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_743;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_744;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_745;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_746;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_747;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_748;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_749;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_750;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_751;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_752;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_753;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_754;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_755;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_756;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_757;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_758;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_759;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_760;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_761;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_762;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_763;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_764;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_765;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_766;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_767;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_768;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_769;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_770;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_771;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_772;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_773;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_774;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_775;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_776;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_777;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_778;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_779;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_780;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_781;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_782;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_783;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_784;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_785;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_786;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_787;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_788;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_789;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_790;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_791;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_792;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_793;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_794;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_795;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_796;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_797;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_798;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_799;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_800;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_801;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_802;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_803;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_804;

