iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_805;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_806;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_807;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_808;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_809;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_810;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_811;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_812;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_813;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_814;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_815;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_816;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_817;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_818;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_819;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_820;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_821;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_822;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_823;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_824;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_825;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_826;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_827;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_828;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_829;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_830;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_831;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_832;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_833;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_834;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_835;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_836;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_837;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_838;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_839;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_840;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_841;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_842;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_843;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_844;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_845;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_846;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_847;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_848;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_849;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_850;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_851;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_852;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_853;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_854;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_855;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_856;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_857;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_858;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_859;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_860;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_861;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_862;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_863;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_864;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_865;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_866;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_867;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_868;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_869;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_870;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_871;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_872;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_873;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_874;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_875;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_876;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_877;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_878;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_879;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_880;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_881;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_882;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_883;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_884;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_885;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_886;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_887;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_888;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_889;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_890;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_891;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_892;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_893;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_894;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_895;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_896;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_897;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_898;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_899;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_900;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_901;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_902;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_903;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_904;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_905;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_906;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_907;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_908;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_909;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_910;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_911;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_912;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_913;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_914;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_915;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_916;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_917;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_918;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_919;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_920;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_921;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_922;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_923;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_924;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_925;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_926;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_927;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_928;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_929;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_930;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_931;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_932;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_933;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_934;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_935;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_936;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_937;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_938;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_939;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_940;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_941;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_942;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_943;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_944;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_945;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_946;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_947;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_948;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_949;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_950;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_951;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_952;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_953;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_954;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_955;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_956;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_957;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_958;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_959;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_960;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_961;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_962;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_963;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_964;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_965;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_966;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_967;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_968;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_969;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_970;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_971;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_972;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_973;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_974;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_975;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_976;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_977;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_978;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_979;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_980;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PACKET_BUFFER:16;
    } __attribute__((packed)) B;
  } PACKET_BUFFER_981;

