iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
#define I2C0 (*(volatile struct I2C0_tag *) 0x40066000)

struct I2C1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } I2C1_A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } I2C1_F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } I2C1_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } I2C1_S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } I2C1_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } I2C1_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:4;
      uint64_t STARTF:1;
      uint64_t SSIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } I2C1_FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } I2C1_RA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SHTF2IE:1;
      uint64_t SHTF2:1;
      uint64_t SHTF1:1;
      uint64_t SLTF:1;
      uint64_t TCKSEL:1;
      uint64_t SIICAEN:1;
      uint64_t ALERTEN:1;
      uint64_t FACK:1;
    } __attribute__((packed)) B;
  } I2C1_SMB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SAD:7;
    } __attribute__((packed)) B;
  } I2C1_A2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } I2C1_SLTH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } I2C1_SLTL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EMPTY:1;
      uint64_t ERROR:1;
      uint64_t DFEN:1;
    } __attribute__((packed)) B;
  } I2C1_S2;

} __attribute__((packed));

#define I2C1 (*(volatile struct I2C1_tag *) 0x40067000)

struct CMP0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t reservedSpace0:2;
      uint64_t FILTER_CNT:3;
    } __attribute__((packed)) B;
  } CMP0_CR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INV:1;
      uint64_t PMODE:1;
      uint64_t TRIGM:1;
      uint64_t WE:1;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } CMP0_CR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } CMP0_FPR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t reservedSpace0:1;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } CMP0_SCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VOSEL:6;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } CMP0_DACCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t PSTM:1;
    } __attribute__((packed)) B;
  } CMP0_MUXCR;

} __attribute__((packed));

#define CMP0 (*(volatile struct CMP0_tag *) 0x40073000)

struct VREF_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM:6;
      uint64_t CHOPEN:1;
    } __attribute__((packed)) B;
  } VREF_TRM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MODE_LV:2;
      uint64_t VREFST:1;
      uint64_t reservedSpace0:2;
      uint64_t ICOMPEN:1;
      uint64_t REGEN:1;
      uint64_t VREFEN:1;
    } __attribute__((packed)) B;
  } VREF_SC;

} __attribute__((packed));

#define VREF (*(volatile struct VREF_tag *) 0x40074000)

struct LLWU_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE0:2;
      uint64_t WUPE1:2;
      uint64_t WUPE2:2;
      uint64_t WUPE3:2;
    } __attribute__((packed)) B;
  } LLWU_PE1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE4:2;
      uint64_t WUPE5:2;
      uint64_t WUPE6:2;
      uint64_t WUPE7:2;
    } __attribute__((packed)) B;
  } LLWU_PE2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE8:2;
      uint64_t WUPE9:2;
      uint64_t WUPE10:2;
      uint64_t WUPE11:2;
    } __attribute__((packed)) B;
  } LLWU_PE3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE12:2;
      uint64_t WUPE13:2;
      uint64_t WUPE14:2;
      uint64_t WUPE15:2;
    } __attribute__((packed)) B;
  } LLWU_PE4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUME0:1;
      uint64_t WUME1:1;
      uint64_t WUME2:1;
      uint64_t WUME3:1;
      uint64_t WUME4:1;
      uint64_t WUME5:1;
      uint64_t WUME6:1;
      uint64_t WUME7:1;
    } __attribute__((packed)) B;
  } LLWU_ME;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUF0:1;
      uint64_t WUF1:1;
      uint64_t WUF2:1;
      uint64_t WUF3:1;
      uint64_t WUF4:1;
      uint64_t WUF5:1;
      uint64_t WUF6:1;
      uint64_t WUF7:1;
    } __attribute__((packed)) B;
  } LLWU_F1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUF8:1;
      uint64_t WUF9:1;
      uint64_t WUF10:1;
      uint64_t WUF11:1;
      uint64_t WUF12:1;
      uint64_t WUF13:1;
      uint64_t WUF14:1;
      uint64_t WUF15:1;
    } __attribute__((packed)) B;
  } LLWU_F2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MWUF0:1;
      uint64_t MWUF1:1;
      uint64_t MWUF2:1;
      uint64_t MWUF3:1;
      uint64_t MWUF4:1;
      uint64_t MWUF5:1;
      uint64_t MWUF6:1;
      uint64_t MWUF7:1;
    } __attribute__((packed)) B;
  } LLWU_F3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILTSEL:4;
      uint64_t reservedSpace0:1;
      uint64_t FILTE:2;
      uint64_t FILTF:1;
    } __attribute__((packed)) B;
  } LLWU_FILT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILTSEL:4;
      uint64_t reservedSpace0:1;
      uint64_t FILTE:2;
      uint64_t FILTF:1;
    } __attribute__((packed)) B;
  } LLWU_FILT2;

} __attribute__((packed));

