iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
struct GPIOB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO0:1;
      uint64_t PDO1:1;
      uint64_t PDO2:1;
      uint64_t PDO3:1;
      uint64_t PDO4:1;
      uint64_t PDO5:1;
      uint64_t PDO6:1;
      uint64_t PDO7:1;
      uint64_t PDO8:1;
      uint64_t PDO9:1;
      uint64_t PDO10:1;
      uint64_t PDO11:1;
      uint64_t PDO12:1;
      uint64_t PDO13:1;
      uint64_t PDO14:1;
      uint64_t PDO15:1;
      uint64_t PDO16:1;
      uint64_t PDO17:1;
      uint64_t PDO18:1;
      uint64_t PDO19:1;
      uint64_t PDO20:1;
      uint64_t PDO21:1;
      uint64_t PDO22:1;
      uint64_t PDO23:1;
      uint64_t PDO24:1;
      uint64_t PDO25:1;
      uint64_t PDO26:1;
      uint64_t PDO27:1;
      uint64_t PDO28:1;
      uint64_t PDO29:1;
      uint64_t PDO30:1;
      uint64_t PDO31:1;
    } __attribute__((packed)) B;
  } GPIOB_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO0:1;
      uint64_t PTSO1:1;
      uint64_t PTSO2:1;
      uint64_t PTSO3:1;
      uint64_t PTSO4:1;
      uint64_t PTSO5:1;
      uint64_t PTSO6:1;
      uint64_t PTSO7:1;
      uint64_t PTSO8:1;
      uint64_t PTSO9:1;
      uint64_t PTSO10:1;
      uint64_t PTSO11:1;
      uint64_t PTSO12:1;
      uint64_t PTSO13:1;
      uint64_t PTSO14:1;
      uint64_t PTSO15:1;
      uint64_t PTSO16:1;
      uint64_t PTSO17:1;
      uint64_t PTSO18:1;
      uint64_t PTSO19:1;
      uint64_t PTSO20:1;
      uint64_t PTSO21:1;
      uint64_t PTSO22:1;
      uint64_t PTSO23:1;
      uint64_t PTSO24:1;
      uint64_t PTSO25:1;
      uint64_t PTSO26:1;
      uint64_t PTSO27:1;
      uint64_t PTSO28:1;
      uint64_t PTSO29:1;
      uint64_t PTSO30:1;
      uint64_t PTSO31:1;
    } __attribute__((packed)) B;
  } GPIOB_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO0:1;
      uint64_t PTCO1:1;
      uint64_t PTCO2:1;
      uint64_t PTCO3:1;
      uint64_t PTCO4:1;
      uint64_t PTCO5:1;
      uint64_t PTCO6:1;
      uint64_t PTCO7:1;
      uint64_t PTCO8:1;
      uint64_t PTCO9:1;
      uint64_t PTCO10:1;
      uint64_t PTCO11:1;
      uint64_t PTCO12:1;
      uint64_t PTCO13:1;
      uint64_t PTCO14:1;
      uint64_t PTCO15:1;
      uint64_t PTCO16:1;
      uint64_t PTCO17:1;
      uint64_t PTCO18:1;
      uint64_t PTCO19:1;
      uint64_t PTCO20:1;
      uint64_t PTCO21:1;
      uint64_t PTCO22:1;
      uint64_t PTCO23:1;
      uint64_t PTCO24:1;
      uint64_t PTCO25:1;
      uint64_t PTCO26:1;
      uint64_t PTCO27:1;
      uint64_t PTCO28:1;
      uint64_t PTCO29:1;
      uint64_t PTCO30:1;
      uint64_t PTCO31:1;
    } __attribute__((packed)) B;
  } GPIOB_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO0:1;
      uint64_t PTTO1:1;
      uint64_t PTTO2:1;
      uint64_t PTTO3:1;
      uint64_t PTTO4:1;
      uint64_t PTTO5:1;
      uint64_t PTTO6:1;
      uint64_t PTTO7:1;
      uint64_t PTTO8:1;
      uint64_t PTTO9:1;
      uint64_t PTTO10:1;
      uint64_t PTTO11:1;
      uint64_t PTTO12:1;
      uint64_t PTTO13:1;
      uint64_t PTTO14:1;
      uint64_t PTTO15:1;
      uint64_t PTTO16:1;
      uint64_t PTTO17:1;
      uint64_t PTTO18:1;
      uint64_t PTTO19:1;
      uint64_t PTTO20:1;
      uint64_t PTTO21:1;
      uint64_t PTTO22:1;
      uint64_t PTTO23:1;
      uint64_t PTTO24:1;
      uint64_t PTTO25:1;
      uint64_t PTTO26:1;
      uint64_t PTTO27:1;
      uint64_t PTTO28:1;
      uint64_t PTTO29:1;
      uint64_t PTTO30:1;
      uint64_t PTTO31:1;
    } __attribute__((packed)) B;
  } GPIOB_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI0:1;
      uint64_t PDI1:1;
      uint64_t PDI2:1;
      uint64_t PDI3:1;
      uint64_t PDI4:1;
      uint64_t PDI5:1;
      uint64_t PDI6:1;
      uint64_t PDI7:1;
      uint64_t PDI8:1;
      uint64_t PDI9:1;
      uint64_t PDI10:1;
      uint64_t PDI11:1;
      uint64_t PDI12:1;
      uint64_t PDI13:1;
      uint64_t PDI14:1;
      uint64_t PDI15:1;
      uint64_t PDI16:1;
      uint64_t PDI17:1;
      uint64_t PDI18:1;
      uint64_t PDI19:1;
      uint64_t PDI20:1;
      uint64_t PDI21:1;
      uint64_t PDI22:1;
      uint64_t PDI23:1;
      uint64_t PDI24:1;
      uint64_t PDI25:1;
      uint64_t PDI26:1;
      uint64_t PDI27:1;
      uint64_t PDI28:1;
      uint64_t PDI29:1;
      uint64_t PDI30:1;
      uint64_t PDI31:1;
    } __attribute__((packed)) B;
  } GPIOB_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD0:1;
      uint64_t PDD1:1;
      uint64_t PDD2:1;
      uint64_t PDD3:1;
      uint64_t PDD4:1;
      uint64_t PDD5:1;
      uint64_t PDD6:1;
      uint64_t PDD7:1;
      uint64_t PDD8:1;
      uint64_t PDD9:1;
      uint64_t PDD10:1;
      uint64_t PDD11:1;
      uint64_t PDD12:1;
      uint64_t PDD13:1;
      uint64_t PDD14:1;
      uint64_t PDD15:1;
      uint64_t PDD16:1;
      uint64_t PDD17:1;
      uint64_t PDD18:1;
      uint64_t PDD19:1;
      uint64_t PDD20:1;
      uint64_t PDD21:1;
      uint64_t PDD22:1;
      uint64_t PDD23:1;
      uint64_t PDD24:1;
      uint64_t PDD25:1;
      uint64_t PDD26:1;
      uint64_t PDD27:1;
      uint64_t PDD28:1;
      uint64_t PDD29:1;
      uint64_t PDD30:1;
      uint64_t PDD31:1;
    } __attribute__((packed)) B;
  } GPIOB_PDDR;

} __attribute__((packed));

#define GPIOB (*(volatile struct GPIOB_tag *) 0x400ff040)

struct GPIOC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO0:1;
      uint64_t PDO1:1;
      uint64_t PDO2:1;
      uint64_t PDO3:1;
      uint64_t PDO4:1;
      uint64_t PDO5:1;
      uint64_t PDO6:1;
      uint64_t PDO7:1;
      uint64_t PDO8:1;
      uint64_t PDO9:1;
      uint64_t PDO10:1;
      uint64_t PDO11:1;
      uint64_t PDO12:1;
      uint64_t PDO13:1;
      uint64_t PDO14:1;
      uint64_t PDO15:1;
      uint64_t PDO16:1;
      uint64_t PDO17:1;
      uint64_t PDO18:1;
      uint64_t PDO19:1;
      uint64_t PDO20:1;
      uint64_t PDO21:1;
      uint64_t PDO22:1;
      uint64_t PDO23:1;
      uint64_t PDO24:1;
      uint64_t PDO25:1;
      uint64_t PDO26:1;
      uint64_t PDO27:1;
      uint64_t PDO28:1;
      uint64_t PDO29:1;
      uint64_t PDO30:1;
      uint64_t PDO31:1;
    } __attribute__((packed)) B;
  } GPIOC_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO0:1;
      uint64_t PTSO1:1;
      uint64_t PTSO2:1;
      uint64_t PTSO3:1;
      uint64_t PTSO4:1;
      uint64_t PTSO5:1;
      uint64_t PTSO6:1;
      uint64_t PTSO7:1;
      uint64_t PTSO8:1;
      uint64_t PTSO9:1;
      uint64_t PTSO10:1;
      uint64_t PTSO11:1;
      uint64_t PTSO12:1;
      uint64_t PTSO13:1;
      uint64_t PTSO14:1;
      uint64_t PTSO15:1;
      uint64_t PTSO16:1;
      uint64_t PTSO17:1;
      uint64_t PTSO18:1;
      uint64_t PTSO19:1;
      uint64_t PTSO20:1;
      uint64_t PTSO21:1;
      uint64_t PTSO22:1;
      uint64_t PTSO23:1;
      uint64_t PTSO24:1;
      uint64_t PTSO25:1;
      uint64_t PTSO26:1;
      uint64_t PTSO27:1;
      uint64_t PTSO28:1;
      uint64_t PTSO29:1;
      uint64_t PTSO30:1;
      uint64_t PTSO31:1;
    } __attribute__((packed)) B;
  } GPIOC_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO0:1;
      uint64_t PTCO1:1;
      uint64_t PTCO2:1;
      uint64_t PTCO3:1;
      uint64_t PTCO4:1;
      uint64_t PTCO5:1;
      uint64_t PTCO6:1;
      uint64_t PTCO7:1;
      uint64_t PTCO8:1;
      uint64_t PTCO9:1;
      uint64_t PTCO10:1;
      uint64_t PTCO11:1;
      uint64_t PTCO12:1;
      uint64_t PTCO13:1;
      uint64_t PTCO14:1;
      uint64_t PTCO15:1;
      uint64_t PTCO16:1;
      uint64_t PTCO17:1;
      uint64_t PTCO18:1;
      uint64_t PTCO19:1;
      uint64_t PTCO20:1;
      uint64_t PTCO21:1;
      uint64_t PTCO22:1;
      uint64_t PTCO23:1;
      uint64_t PTCO24:1;
      uint64_t PTCO25:1;
      uint64_t PTCO26:1;
      uint64_t PTCO27:1;
      uint64_t PTCO28:1;
      uint64_t PTCO29:1;
      uint64_t PTCO30:1;
      uint64_t PTCO31:1;
    } __attribute__((packed)) B;
  } GPIOC_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO0:1;
      uint64_t PTTO1:1;
      uint64_t PTTO2:1;
      uint64_t PTTO3:1;
      uint64_t PTTO4:1;
      uint64_t PTTO5:1;
      uint64_t PTTO6:1;
      uint64_t PTTO7:1;
      uint64_t PTTO8:1;
      uint64_t PTTO9:1;
      uint64_t PTTO10:1;
      uint64_t PTTO11:1;
      uint64_t PTTO12:1;
      uint64_t PTTO13:1;
      uint64_t PTTO14:1;
      uint64_t PTTO15:1;
      uint64_t PTTO16:1;
      uint64_t PTTO17:1;
      uint64_t PTTO18:1;
      uint64_t PTTO19:1;
      uint64_t PTTO20:1;
      uint64_t PTTO21:1;
      uint64_t PTTO22:1;
      uint64_t PTTO23:1;
      uint64_t PTTO24:1;
      uint64_t PTTO25:1;
      uint64_t PTTO26:1;
      uint64_t PTTO27:1;
      uint64_t PTTO28:1;
      uint64_t PTTO29:1;
      uint64_t PTTO30:1;
      uint64_t PTTO31:1;
    } __attribute__((packed)) B;
  } GPIOC_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI0:1;
      uint64_t PDI1:1;
      uint64_t PDI2:1;
      uint64_t PDI3:1;
      uint64_t PDI4:1;
      uint64_t PDI5:1;
      uint64_t PDI6:1;
      uint64_t PDI7:1;
      uint64_t PDI8:1;
      uint64_t PDI9:1;
      uint64_t PDI10:1;
      uint64_t PDI11:1;
      uint64_t PDI12:1;
      uint64_t PDI13:1;
      uint64_t PDI14:1;
      uint64_t PDI15:1;
      uint64_t PDI16:1;
      uint64_t PDI17:1;
      uint64_t PDI18:1;
      uint64_t PDI19:1;
      uint64_t PDI20:1;
      uint64_t PDI21:1;
      uint64_t PDI22:1;
      uint64_t PDI23:1;
      uint64_t PDI24:1;
      uint64_t PDI25:1;
      uint64_t PDI26:1;
      uint64_t PDI27:1;
      uint64_t PDI28:1;
      uint64_t PDI29:1;
      uint64_t PDI30:1;
      uint64_t PDI31:1;
    } __attribute__((packed)) B;
  } GPIOC_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD0:1;
      uint64_t PDD1:1;
      uint64_t PDD2:1;
      uint64_t PDD3:1;
      uint64_t PDD4:1;
      uint64_t PDD5:1;
      uint64_t PDD6:1;
      uint64_t PDD7:1;
      uint64_t PDD8:1;
      uint64_t PDD9:1;
      uint64_t PDD10:1;
      uint64_t PDD11:1;
      uint64_t PDD12:1;
      uint64_t PDD13:1;
      uint64_t PDD14:1;
      uint64_t PDD15:1;
      uint64_t PDD16:1;
      uint64_t PDD17:1;
      uint64_t PDD18:1;
      uint64_t PDD19:1;
      uint64_t PDD20:1;
      uint64_t PDD21:1;
      uint64_t PDD22:1;
      uint64_t PDD23:1;
      uint64_t PDD24:1;
      uint64_t PDD25:1;
      uint64_t PDD26:1;
      uint64_t PDD27:1;
      uint64_t PDD28:1;
      uint64_t PDD29:1;
      uint64_t PDD30:1;
      uint64_t PDD31:1;
    } __attribute__((packed)) B;
  } GPIOC_PDDR;

} __attribute__((packed));

