iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/KW36/emptyTargetInit/KW36_sfr.h
#define GPIOC (*(volatile struct GPIOC_tag *) 0x400ff080)

struct MTB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t WRAP:1;
      uint64_t POINTER:29;
    } __attribute__((packed)) B;
  } MTB_POSITION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
      uint64_t TSTARTEN:1;
      uint64_t TSTOPEN:1;
      uint64_t SFRWPRIV:1;
      uint64_t RAMPRIV:1;
      uint64_t HALTREQ:1;
      uint64_t reservedSpace0:21;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } MTB_MASTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTOSTOP:1;
      uint64_t AUTOHALT:1;
      uint64_t reservedSpace0:1;
      uint64_t WATERMARK:29;
    } __attribute__((packed)) B;
  } MTB_FLOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASEADDR:32;
    } __attribute__((packed)) B;
  } MTB_BASE;

  uint8_t res0[3824];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODECTRL:32;
    } __attribute__((packed)) B;
  } MTB_MODECTRL;

  uint8_t res1[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAGSET:32;
    } __attribute__((packed)) B;
  } MTB_TAGSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAGCLEAR:32;
    } __attribute__((packed)) B;
  } MTB_TAGCLEAR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKACCESS:32;
    } __attribute__((packed)) B;
  } MTB_LOCKACCESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKSTAT:32;
    } __attribute__((packed)) B;
  } MTB_LOCKSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIT0:1;
      uint64_t BIT1:1;
      uint64_t BIT2:1;
      uint64_t BIT3:1;
    } __attribute__((packed)) B;
  } MTB_AUTHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICEARCH:32;
    } __attribute__((packed)) B;
  } MTB_DEVICEARCH;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICECFG:32;
    } __attribute__((packed)) B;
  } MTB_DEVICECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICETYPID:32;
    } __attribute__((packed)) B;
  } MTB_DEVICETYPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTB_PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTB_COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTB_COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTB_COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTB_COMPID3;

} __attribute__((packed));

#define MTB (*(volatile struct MTB_tag *) 0xf0000000)

struct MTBDWT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DWTCFGCTRL:28;
      uint64_t NUMCMP:4;
    } __attribute__((packed)) B;
  } MTBDWT_CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
    } __attribute__((packed)) B;
  } MTBDWT_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:4;
      uint64_t DATAVMATCH:1;
      uint64_t reservedSpace1:1;
      uint64_t DATAVSIZE:2;
      uint64_t DATAVADDR0:4;
      uint64_t reservedSpace2:8;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } MTBDWT_FCT0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:5;
    } __attribute__((packed)) B;
  } MTBDWT_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCTION:4;
      uint64_t reservedSpace0:20;
      uint64_t MATCHED:1;
    } __attribute__((packed)) B;
  } MTBDWT_FCT1;

  uint8_t res2[452];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACOMP0:1;
      uint64_t ACOMP1:1;
      uint64_t reservedSpace0:26;
      uint64_t NUMCOMP:4;
    } __attribute__((packed)) B;
  } MTBDWT_TBCTRL;

  uint8_t res3[3524];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICECFG:32;
    } __attribute__((packed)) B;
  } MTBDWT_DEVICECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICETYPID:32;
    } __attribute__((packed)) B;
  } MTBDWT_DEVICETYPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } MTBDWT_PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } MTBDWT_COMPID3;

} __attribute__((packed));

#define MTBDWT (*(volatile struct MTBDWT_tag *) 0xf0001000)

struct ROM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } ROM_ENTRY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } ROM_ENTRY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENTRY:32;
    } __attribute__((packed)) B;
  } ROM_ENTRY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MARK:32;
    } __attribute__((packed)) B;
  } ROM_TABLEMARK;

  uint8_t res0[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSACCESS:32;
    } __attribute__((packed)) B;
  } ROM_SYSACCESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHID:32;
    } __attribute__((packed)) B;
  } ROM_PERIPHID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } ROM_COMPID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } ROM_COMPID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } ROM_COMPID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPID:32;
    } __attribute__((packed)) B;
  } ROM_COMPID3;

} __attribute__((packed));

#define ROM (*(volatile struct ROM_tag *) 0xf0002000)

struct MCM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t ASC:8;
    } __attribute__((packed)) B;
  } MCM_PLASC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:8;
    } __attribute__((packed)) B;
  } MCM_PLAMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t ARB:1;
      uint64_t CFCC:1;
      uint64_t DFCDA:1;
      uint64_t DFCIC:1;
      uint64_t DFCC:1;
      uint64_t EFDS:1;
      uint64_t DFCS:1;
      uint64_t ESFC:1;
    } __attribute__((packed)) B;
  } MCM_PLACR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOREQ:1;
      uint64_t CPOACK:1;
      uint64_t CPOWOI:1;
    } __attribute__((packed)) B;
  } MCM_CPO;

} __attribute__((packed));

